Repository: dojot/docs
Catalog: source/locale/*/LC_MESSAGES/faq.po
Languages: pt_br

source: Can I correlate data from different devices in the same flow?
pt_br: Posso correlacionar dados de diferentes dispositivos no mexmo fluxo?

source: As the data flow is processed individually for each message, you need to create a virtual device to aggregate all attributes, then use this virtual device as the input of the flow.
pt_br: Uma vez que os fluxos são aplicados individualmente para cada mensagem, você deve criar um dispositivo virtual para agregar todos os atributos e então usar este dispositivo como entrada de um novo fluxo.

source: Another thing that you could do is to build a flowbroker node to deal with contexts, which can be used to store and retrieve data related to a flow or node.
pt_br: Outra coisa que pode ser feita é construir um nó do flowbroker paralidar com contextos, os quais podem ser usados para armazenar e obter dadosrelacionados a um fluxo ou nó.

source: What about a HTTP POST request, how can I send it?
pt_br: E se eu quiser enviar um HTTP POST?

source: One important note: make sure that dojot can access your server.
pt_br: Um aviso importante: assegure-se de que a dojot consegue acessar seu servidor.

source: I want to rename the attributes of a device, what should I do?
pt_br: Eu quero renomear os atributos de um dispositivo. O que eu devo fazer?

source: First of all, you need to create a virtual device with the new attributes, then you build a data flow to rename them. This can be done connecting a ‘change’ node after the input device to map the input attributes to the corresponding ones into an output, and finally connecting the ‘change’ to the virtual device and assigning to it the output.
pt_br: Primeiramente, você deve criar um dispositivo virtual com os novos atributos, para então construir um fluxo de dados para renomeá-los. Isto pode ser feito conectando um nó 'change' após um dispositivo de entrada para mapear os atributos de entada a seus correspondentes na saída.

source: I want to aggregate the attributes of multiple devices, what should I do?
pt_br: Quero agregar os atributos de múltiplos dispositivos. O que eu devo fazer?

source: First of all, you need to create a virtual device to aggregate all attributes, then you build a data flow to map the attributes of each device to the virtual one. This can be done connecting a ‘change’ node after each input device to put the input values into an output, and finally connecting all changes to the virtual device and assigning to it the output.
pt_br: Inicialmente, você deve criar um dispositivo virtual para agregar todos os atributos. Com este dispositivo criado, você deve criar fluxos para mapeamento dos atributos de cada dispositivo real de entrada neste dispositivo virtual. Isto pode ser feito em nós 'change' conectados a cada um dos dispositivos de entrada a fim de criar uma variável contendo todos os atributos de saída. Todos os nós change devem ser, por fim, conectados ao nó de saída representando o dispositivo virtual.

source: How can I add a new node type to its menu?
pt_br: Como eu posso adicionar um novo tipo de nó no menu?

source: And that's it! In the https://github.com/dojot/flowbroker/tree/master/lib, there is two examples of how to build a Docker image that could be added to flow node menu.
pt_br: E é isso! Em https://github.com/dojot/flowbroker/tree/master/lib há 2 exemplos de como construir uma imagem do Docker que pode ser adicionada ao menu de nós do flowbroker.

source: Applications
pt_br: Aplicações

source: What APIs are available for applications?
pt_br: Quais APIs estão disponíveis para aplicações?

source: You can check all available APIs in the `API Listing page <../components-and-apis.html>`_
pt_br: Você pode ver todas as APIs disponíveis na página `API Listing page <../components-and-apis.html>`_

source: How can I use them?
pt_br: Como posso usá-los?

source: There is a very quick and useful tutorial in the :ref:`Using API interface`.
pt_br: Há um tutorial simples e rápido na in the :ref:`Using API interface`.

source: I'm interested in integrating my application with dojot. How can I do it?
pt_br: Estou interessado(a) em integrar minha aplicação com dojot. O que devo fazer?

source: This should be pretty straightforward. There are two ways that your application could be integrated with dojot:
pt_br: Isto deve ser bastante direto. Há duas formas de integrar sua aplicação à dojot:

source: **Retrieving historical data**: you might want to periodically read all historical data related to a device. This can be done by using this API (one side-note: all endpoints described in this apiary should be preceded by ``/history/``).
pt_br: **Obtenção de dados históricos**: você pode querer ler todos os dados históricos relacionados a um dispositivo de forma periódica. Isto pode se feito usando esta API (um lembrete apenas: todos os serviços descritos neste apiary deve ser precedido de ``/history/``).

source: **Using flowbroker to pre-process data**: if you want to do something more, you could use flows. They can help process and transform data so that they can be properly sent to your application via HTTP request, or stored in a virtual device (which can be used to generate notifications as previously described).
pt_br: **Usar os fluxos de dados para pré-processar dados**: se for necessário realizar algum processamento extra, você pode usar os fluxos. Eles auxiliam no processamento e na transformação de dados para envio para sua aplicação via requisições HTTP. Uma outra forma é armazenar os dados em dispositivos virtuais (que podem ser usados para gerar notificações como descrito anteriormente).

source: All these endpoints should bear an access token, which is retrieved as described in the question `How can I use them?`_.
pt_br: Todas as requisições devem carregar um token de acesso, o qual pode ser obtido como descrito na pergunta `Como posso usá-los?`_.
