Repository: dojot/docs
Catalog: source/locale/*/LC_MESSAGES/faq.po
Languages: pt_br

source: Frequently Asked Questions
pt_br: Dúvidas Mais Frequentes

source: Here are some answers to frequently-asked questions from users of dojot platform.
pt_br: Aqui estão algumas respostas às dúvidas mais frequentes sobre a plataforma dojot.

source: Got a question that isn't answered here? Please, open an issue on `dojot's Github repository <http://github.com/dojot/dojot>`_.
pt_br: Não encontrou aqui uma resposta para a sua dúvida? Por favor, abra uma `issue` no `repositório da dojot no Github <http://github.com/dojot/dojot>`_.

source: **Table of Contents**
pt_br: Sumário

source: General
pt_br: Gerais

source: What is dojot? Why should I use it? Why open source it?
pt_br: O que é a dojot? Por que eu deveria utilizá-la? Por que abrir o código?

source: It’s a brazilian IoT platform launched as open source software with aims to ease the development of solutions and the IoT ecosystem with local resources geared towards brazilians needs.
pt_br: É uma plataforma brasileira para IoT que surgiu com uma proposta de código aberto, para facilitar o desenvolvimento de soluções e o ecossistema IoT com conteúdo local voltado às necessidades brasileiras.

source: It takes a role as an enabler platform with:
pt_br: Ela oferece

source: Open APIs which makes the access to the platform resources easy.
pt_br: APIs abertas tornando o acesso fácil das aplicações aos recursos da plataforma.

source: Capacity to store large volumes of data in different formats.
pt_br: Capacidade de armazenamento de grandes volumes de dados em diferentes formatos.

source: Connectors to different types of devices.
pt_br: Conectores para diferentes tipos de dispositivos.

source: Graphical user interface with flow builder to quicly prototype IoT solutions.
pt_br: Construção de fluxos de dados e regras de forma visual, permitindo a rápida prototipação e validação de cenários de aplicações IoT.

source: Real time event processing with customizable rules.
pt_br: Processamento de eventos em tempo real aplicando regras definidas pelo desenvolvedor.

source: Where can I get it?
pt_br: Onde eu posso baixar?

source: All components are available in dojot's GitHub repositories: `<https://github.com/dojot>`_.
pt_br: Todos os componentes estão disponíveis no repositório da dojot no GitHub: `<https://github.com/dojot>`_.

source: Which repository is the main one?
pt_br: Qual é o principal repositório?

source: There are 3 main ones:
pt_br: Existem 3 repositórios principais:

source: `<https://github.com/dojot/dojot>`_: this is where we keep track of all the things related to this project as a whole, such as architectural enhancements.
pt_br: `<https://github.com/dojot/dojot>`_: é aqui que concentramos o acompanhamento de tudo relacionado a este projeto como decisões de arquitetura e melhorias.

source: `<https://github.com/dojot/docker-compose>`_: repository for Docker compose files and configurations. This is what we would recommend to use to start with.
pt_br: `<https://github.com/dojot/docker-compose>`_: repositório com os arquivos e configurações para o docker-compose. Este é o repositório que recomendamos para começar com a dojot.

source: `<https://github.com/dojot/ansible-dojot>`_: repository for ansible (kubernetes) files and configurations.
pt_br: `<https://github.com/dojot/ansible-dojot>`_: repositório com os arquivos e configurações para utilizar kubernetes.

source: So, I found this pesky bug. How can I inform you about it?
pt_br: Então, encontrei um probleminha chato. Como posso informá-lo sobre isso?

source: We ask you to open an issue in `dojot's Github repository <http://github.com/dojot/dojot>`_.
pt_br: Não encontrou aqui uma resposta para a sua dúvida? Por favor, abra uma `issue` no `repositório da dojot no Github <http://github.com/dojot/dojot>`_.

source: If you are able to analyze and fix this bug, please do so. Create a pull-request with a quick description of what you've done.
pt_br: Se você puder analisar e resolver o problema, por favor faça isso e crie um `pull-request` com uma breve descrição do que foi feito.

source: Usage
pt_br: Uso

source: How do I start it? Is it CLI-based or it has a graphical user interface?
pt_br: Por onde eu começo? É baseado em CLI ou possui uma interface gráfica de usuário ?

source: dojot can be accessed by a nice web-based interface and by REST APIs. Considering that you installed ``docker`` and ``docker-compose`` and cloned the ``docker-compose`` repository, starting it up is done by just one command:
pt_br: A dojot pode ser acessada via interface Web ou APIs REST. Considerando que você já tenha instalado o ``docker`` e o ``docker-compose`` e tenha clonado o repositório dojot para o ``docker-compose``, para iniciar todos os serviços, basta executar o comando abaixo:

source: And that's it.
pt_br: E é isto.

source: The web interface is available at ``http://localhost:8000``. The user is ``admin``, password ``admin``.
pt_br: A interface Web está disponível em ``http://localhost:8000``. O usuário é ``admin`` e a senha é ``admin``.

source: REST APIs are explained in the `Applications`_ section.
pt_br: APIs REST são explicadas na seção `Aplicações`_.

source: Ok, I started it and I logged in. Now what?
pt_br: Pronto, já iniciei e fiz o `login`. E agora?

source: Nice! Now you can add your templates and devices, described in `Devices`_, build some flows and subscribing to device events, both described in `Data Flows`_.
pt_br: Legal! Agora você pode criar seus primeiros templates e dispositivos, descrito em `Dispositivos`_, criar alguns fluxos e registrar-se para eventos de dispositivos, ambos descritos em `Fluxos de Dados`_.

source: How can I update my deploy to dojot's latest version?
pt_br: Como posso atualizar o meu ambiente com a última versão da dojot?

source: You need to follow some steps:
pt_br: Basta seguir alguns passos:

source: 1 Update the docker-compose repository to the latest version.
pt_br: 1 Atualize o repositório do docker compose com a última versão.

source: If you need another version, you could checkout a tag instead:
pt_br: Se você precisar de uma outra versão, você pode fazer *checkout* de uma tag:

source: Once in a while we'll release new versions for dojot components. They might be independently released (although we tend to synchronize all of them). Once we end up with a stable set of component versions, we'll update the docker-compose repository.
pt_br: De tempos em tempos nós lançaremos novas versões para componentes dadojot. Eles podem ser lançados individualmente (no entanto, tentaremossincronizar todos os lançamentos). Uma vez que nós tenhamos um conjunto decomponentes que opere de forma estável, atualizaremos o repositório do docker-compose

source: 2 Deploy the latest docker images. This command might need ``sudo``.
pt_br: Atualize o ambiente com as imagens dockers mais recentes.

source: This procedure also applies to the available virtual machines once they do use docker-compose.
pt_br: Este procedimento também se aplica para as máquinas virtuais dojot uma vez que as mesmas utilizam `docker-compose`.

source: Devices
pt_br: Dispositivos

source: What are *devices* for dojot?
pt_br: O que são dispositivos para a dojot?

source: In dojot, a device is a digital representation of an actual device or gateway with one or more sensors or of a virtual one with sensors/attributes inferred from other devices.
pt_br: Na dojot, um dispositivo é uma representação digital para um dispositivo real ou gateway com um ou mais sensores ou uma representação para um dispositivo virtual com sensores/atributos inferidos de outros dispositivos.

source: Consider, for instance, an actual device with thermal and humidity sensors; it can be represented inside dojot as a device with two attributes (one for each sensor). We call this kind of device as *regular device* or by its communication protocol, for instance, *MQTT device* or *CoAP device*.
pt_br: Considere, por exemplo, um dispositivo real com um termômetro e umhigrômetro; ele pode ser representado na dojot como um dispositivo com doisatributos (um para cada sensor). Chamamos este tipo de dispositivo de*dispositivo normal* ou usando o seu protocolo de comunicação, como*dispositivo MQTT* ou *dispositivo CoAP*.

source: We can also create devices which don’t directly correspond to their physical counterparts, for instance, we can create one with a higher level of temperature information (*is becoming hotter* or *is becoming colder*) whose values are inferred from temperature sensors of other devices. This kind of device is called *virtual device*.
pt_br: Nós também podemos criar dispositivos que não correspondem diretamente a dispositivos reais, por exemplo, podemos criar um dispositivo com informação em alto nível de temperatura (*está ficando mais quente* ou *está ficando mais frio*) cujos valores são inferidos a partir de sensores de temperatura de outros dispositivos. Este tipo de dispositivo é denominado de *dispositivo virtual*.

source: What is the relationship between this *device* and my actual device?
pt_br: Qual é a relação entre este *dispositivo* e um dispositivo real?

source: It is as simple as it seems: the *regular device* for dojot is a mirror (digital twin) of your actual device. You can choose which attributes are available for applications and other components by adding each one of them at the device creation interface.
pt_br: É simples como parece: o *dispositivo* para a dojot é um espelho (gêmeo/cópia digital) do dispositivo real. Você pode escolher quais atributos são disponibilizados para as aplicações e outros componentes, adicionando cada um deles através da interface de criação de dispositivo.

source: What are *virtual devices*? How are they different from the other one?
pt_br: O que são *dispositivos virtuais*? Como se diferenciam dos demais?

source: *Regular devices* are created to serve as a mirror (digital twin) for the actual devices and sensors. A *virtual device* is an abstraction that models things that are not feasible in the real world. For instance, let's say that a user has few smoke detectors in a laboratory, each one with different attributes.
pt_br: *Dispositivos* são criados para serem como espelhos (gêmeo/cópia digital) dos dispositivos e sensores reais. Um *dispositivo virtual* é uma abstração que modela coisas que não são factíveis no mundo real. Por exemplo, digamos que um usuário tenha alguns sensores para detectar fumaça em um laboratório, sendo que cada um tem diferentes atributos.

source: Wouldn't it be nice if we had one device called *Laboratory* that has one attribute *isOnFire*? Therefore, the applications could rely only on this attribute to take an action.
pt_br: Não seria bom se exisitisse um dispositivo chamado *Laboratório* quepossui um atributo *emChamas*? Assim a aplicação dependeria apenas desteatributo para tomar alguma ação.

source: Another difference is how virtual devices are populated. Regular ones will be filled with information sent by devices or gateways to the platform and virtual ones will be filled by flows or by applications.
pt_br: Uma outra diferença é a maneira como os dados dos dispositivos virtuais são populados. Os dispositivos são preenchidos com informações enviadas aplataforma dojot por dispositivos ou gateways e os virtuais são preenchidos por fluxos ou por aplicações.

source: And what are *templates*?
pt_br: E o que são *templates*?

source: Templates, simply put, are "blueprints for devices" which serve as basis to create a new device. A single device is built using a set of templates - its attributes will be inherited from each template (their names must not be exactly the same, though). If one template is changed, then all associated devices will also be changed.
pt_br: Templates são "modelos para dispositivos" que servem como base para acriação de um novo dispositivo. Um dispositivo é construído usando um conjuntode templates - seus atributos serão herdados de cada template (não deve havernenhum atributo com mesmo nome, no entanto). Se um template é alterado, todosos dispositivos associados àquele template serão também alteradosautomaticamente.

source: How can I send MQTT data to dojot so that it appears on the dashboard?
pt_br: Como posso enviar dados via MQTT para a dojot de forma que apareçam no `dashboard`?

source: First of all, you create a digital representation for your actual device. Then, you configure it to send data to dojot so that it matches its digital representation.
pt_br: Primeiramente, crie uma representação digital para o seu dispositivo real. Depois, configure o seu dispositivo real para enviar dados para a dojot de maneira que os dados possam ser associados ao seu representante digital.

source: Let’s take as example a weather station which measures temperature and humidity, and publishes them periodically through MQTT. First, you create a device of type MQTT with two attributes (temperature and humidity). Then you set your actual device to push the data to dojot.
pt_br: Tomemos como exemplo uma estação meteorólogica que monitora temperatura e umidade e publica essas medidas via MQTT periodicamente. Inicialmente, cria-se um dispositivo do tipo MQTT com dois atributos (temperatura e umidade) e, em seguida, configura-se a estação meteorológica para publicar os dados para a dojot.

source: As of **v0.5.0**, you can choose the between two MQTT brokers: Mosca or VerneMQ. By default, VerneMQ is used, but you can use Mosca too. Check the :doc:`../installation-guide` for more information.
pt_br: A partir da versão **v0.5.0**, você pode escolher entre dois brokers MQTT: Mosca ou VerneMQ. Por padrão, o VerneMQ é utilizado, mas você pode utilizar o Mosca também. Verifique o :doc:`../installation-guide` para mais informações.

source: In order to send data to dojot via MQTT (using Mosca or VerneMQ), there are some things to keep in mind:
pt_br: Para enviar dados para a dojot via MQTT (usando o Mosca ou VerneMQ), existem alguns pontos a se ter em mente:

source: When using Mosca, the topic should look like ``/<tenant>/<device-id>/attrs`` (e.g.: ``/admin/efac/attrs``). Depending on how IoT agent MQTT was started (more strict), the client ID must also be set to ``<tenant>:<deviceid>``, such as ``admin:efac``.
pt_br: Ao usar o Mosca, o tópico deve seguir o formato ``/<tenant>/<device-id>/attrs`` (e.g.: ``/admin/efac/attrs``). Dependendo de como o IoT agent MQTT foi inicializado (mais restritivo), o client ID também deve ser configurado para ``<tenant>:<deviceid>``, como ``admin:efac``.

source: When using VerneMQ, the topic should look like ``<tenant>:<device-id>/attrs`` (e.g.: ``admin:efac/attrs``). You must also set the username for the client as ``<tenant>:<device-id>``, such as ``admin:efac``, and it should match the same part in the topic. You can also set the client ID too (not required).
pt_br: Ao utilizar o VerneMQ, o tópico deve seguir o formato ``<tenant>:<device-id>/attrs`` (e.g.: ``admin:efac/attrs``). Além disso, você deve passar o `username` do cliente no formato ``<tenant>:<device-id>``, como ``admin:efac``, sendo que este deve ser igual à mesma parte passada no tópico. Você também pode passar o ID do cliente (opcional).

source: MQTT payload must be a JSON with each key being an attribute of the dojot device, such as:
pt_br: O `payload` MQTT precisa ser um JSON com cada chave sendo um atributo de um dispositivo definido na dojot, como:

source: On the dashboard some attributes are shown as tables and others as charts. How are they chosen/set?
pt_br: No `dashboard` alguns atributos são exibidos como tabelas e outros como gráficos. Como são escolhidos/configurados?

source: The type of an attribute determines how the data is shown on the dashboard as follows:
pt_br: O tipo do atributo determina o modo de exibição dos dados no `dashboard` como segue:

source: ``Geo``: geo map.
pt_br: ``Geo``: mapa georreferenciado.

source: ``Boolean`` and ``Text``: table.
pt_br: ``Boolean`` e ``Text``: tabela

source: ``Integer`` and ``Float``: line chart.
pt_br: ``Integer`` e ``Float``: gráfico de linha.

source: I'm interested in integrating my super cool device with dojot. How can I do it?
pt_br: Estou interessado em integrar à dojot o meu dispositivo que é super legal. Como eu faço isso?

source: If your device is able to send messages using MQTT (with JSON payload), CoAP or HTTP, there is a good chance that your device can be integrated with minor or no modifications whatsoever.
pt_br: Se o seu dispositivo envia mensagens via MQTT (com `payload` do tipo JSON), CoAP ou HTTP, existe uma grande chance de ser possível intergrá-lo com mínima ou nenhuma modificação.

source: Is there any restrictions about the message my device will send to dojot? Format, size, frequency?
pt_br: Existem restrições para as mensagens enviadas pelo meu dispositivo para a dojot? Formato, tamanho, frequência?

source: None but format, which is described in the question `How can I send MQTT data to dojot so that it appears on the dashboard?`_.
pt_br: Nenhuma com exceção do formato, que é descrito na questão `How can I send MQTT data to dojot so that it appears on the dashboard?`_.

source: How can I send some commands to my device through dojot?
pt_br: Como posso enviar comandos para o meu dispositivo através da dojot?

source: For now, you can send HTTP requests to dojot containing a few instructions about which device should be configured and the actuation payload itself. More details on that can be found in `Device-Manager how-to - sending actuation messages`_.
pt_br: Por enquanto, você pode enviar requisições HTTP para a dojot contendoalgumas instruções sobre qual dispositivo deve ser configurado e os dados paraatuação. Mais detalhes podem ser encontrados na seção `Device-Manager how-to - sending actuation messages`_.

source: I didn’t find the protocol supported by my device in the type list, is there anything I can do?
pt_br: Não encontrei o protocolo suportado pelo meu dispositivo na lista de tipos, existe algo que eu possa fazer?

source: There are some possibilities. The first one is to develop a proxy to translate your protocol to one supported by dojot. The second one is to develop a IotAgent, a connector, similar to the existing ones for MQTT, CoAP and HTTP. Take a look at https://github.com/dojot/iotagent-nodejs
pt_br: Existem algumas possibilidades. A primeira é desenvolver um `proxy` para traduzir o seu protocolo para um dos suportados pela dojot. A segunda é desenvolver um IotAgent, conector, similar as existentes para MQTT, CoAP e HTTP. Dê uma olhada em https://github.com/dojot/iotagent-nodejs

source: I saved an attribute, but it disappeared from the device. Is it a bug?
pt_br: Eu salvei um atributo, mas o mesmo sumiu do dispositivo. É um defeito?

source: You might have saved the attribute, but not the device. If you don’t click on the save button for the device, the added attributes will be discarded. We’re improving the system messages to caveat the users and remember them to save their configurations.
pt_br: Provavelmente você salvou o atributo, mas não o dispositivo. Se você não clicar no botão para salvar o dispositivo, o atributo adicionado será descartado. Estamos melhorando as mensagens da plataforma para avisar e lembrar os usuários de salvarem as suas configurações.

source: How can I retrieve historical data for a particular device?
pt_br: Compo eu posso obter dados históricos para um dispositivo em particular?

source: You can do this by sending a request to /history endpoint, such as:
pt_br: Você pode fazer isto enviando uma requisição para `/history/`, como:

source: which will retrieve the last 3 entries of `temperature` attribute from the device `3bb9`:
pt_br: o qual retornará as últimas 3 entradas do atributo `temperature` dodispositivo `3bb9`

source: There are more operators that could be used to filter entries. Check `History API <https://dojot.github.io/history/apiary_latest.html>`_ documentation to check out all possible operators and other filters.
pt_br: Há mais operadores que podem ser usados para filtrar entradas. Check `History API <https://dojot.github.io/history/apiary_latest.html>`_ para ver todas os possíveis operadores e outros filtros.

source: Data Flows
pt_br: Fluxos de Dados

source: What is data flow?
pt_br: O que é um fluxo?

source: It’s a sequence of functional blocks to process incoming device messages. With a flow you can dynamically analyze each new message in order to apply validations, infer information and trigger actions or notifications.
pt_br: É um processamento de mensagens de um dispositivo. Com um fluxo, você pode analisar dinamicamente cada nova mensagem para fazer validações, inferirinformações e tomar ações ou gerar notificações.

source: The data flow UI… really looks like node-RED. Are they related in some way?
pt_br: A interface dos fluxos... ela se parece com o node-RED. Eles tem alguma relação?

source: It’s based on the Node-RED frontend, but uses its own engine to process the messages. If you’re familiar with Node-Red, it won't be difficult to use it.
pt_br: A interface dos fluxos é baseada no node-RED, mas a aplicação das regras e execução das ações é feita por um mecanismo próprio da dojot. Se o node-REDfor familiar para você, não será difícil usar o flowbroker.

source: Why should I use it?
pt_br: Por que eu deveria usar um fluxo?

source: It allows one of the coolest things of IoT in an easy and intuitive way, which is to analyze data for extracting information and then take actions.
pt_br: Ele permite uma das coisas mais interessantes do IoT de uma forma simples e intuitiva que é analisar dados para extração de informações e execução de ações.

source: What can it do, exactly?
pt_br: O que ele pode fazer, exatamente?

source: You can do things such as:
pt_br: Você pode fazer coisas como:

source: Create views from a particular device, by renaming, aggregating and changing values, etc).
pt_br: Criar visões para um dispositivo (renomear atributos, agregá-los, alterá-los, etc.)

source: Infer information based on switch, edge-detection and geo-fence rules.
pt_br: Inferir informações baseadas em regras de detecção de borda e georreferenciamento.

source: Notify through email.
pt_br: Enviar notificações via email.

source: Notify through HTTP.
pt_br: Enviar notificações via HTTP.

source: The data flows component is in constantly development with new features being added every new release.
pt_br: O componente responsável pelo fluxo de dados está em desenvolvimento constante e novas funcionalidades são adicionadas a cada versão.

source: There are mechanisms to add new processing blocks to new flows. Check the `How can I add a new node type to its menu?`_ question for more information on that.
pt_br: Há mecanismos para adicionar novos blocos de processamento a fluxos. Veja `How can I add a new node type to its menu?`_ para mais informações sobreisto.

source: So, how can I use it?
pt_br: Pois bem, como eu posso usá-lo?

source: It follows the basic usage flow as node-RED. You can check its `documentation <https://nodered.org>`_ for more details about this.
pt_br: Ele segue o modo de uso do node-RED. Você pode ler a `documentação <https://nodered.org>`_ para mais detalhes.

source: Can I apply the same flow to multiple devices?
pt_br: Posso aplicar o mesmo fluxo para múltiplos dispositivos?

source: You can use a template as input to indicate that the flow should be applied to all devices associated to that template. It’s worth to point out that the flow is processed individually for each new input message, i.e. for each input device.
pt_br: Você pode usar um template como entrada para indicar que ele deve serexecutado para todos os dispositivos associados àquele template. É válidoindicar que o fluxo é sempre executado para cada mensagem.
