Repository: dojot/docs
Catalog: source/locale/*/LC_MESSAGES/install.po
Languages: pt_br

source: This document provides instructions on how to create a trivial deployment environment on single host for dojot, using docker-compose as the processes orchestration platform.
pt_br: Este documento fornece instruções de como criar um ambiente trivial de implantação para a plataforma dojot em uma única máquina, utilizando o docker-compose como plataforma de orquestração de processos.

source: While very simple, this deployment option is best suited to development and assessment of the platform and should not be used for production environments.
pt_br: Embora muito simples, esta opção de implantação é adequada para desenvolvimento e avaliação da plataforma dojot e não deve ser utilizada em ambientes de produção.

source: This guide has been checked on an Ubuntu 16.04 LTS environment.
pt_br: Este guia foi validado em ambiente com Ubuntu 16.04 LTS.

source: Dependencies
pt_br: Dependências

source: This setup has two software requirements docker engine and docker-compose.
pt_br: Esta configuração tem dois requisitos de software: docker e docker-compose.

source: Docker engine
pt_br: Docker

source: Up to date information and installation procedures for the docker engine can be found at the project's documentation:
pt_br: Informações atualizadas do processo de instalação do docker podem ser encontradas na documentação do seu projeto:

source: An optional step on the installation and configuration process of docker on any given machine is the setting of who is eligible for creating/spawning docker instances.
pt_br: Um passo adicional no processo de instação e configuração do docker, independentemente da máquina, é configurar quem é elegível para criar/instanciar instâncias de docker.

source: Should the post-installation steps (more specifically the "Manage docker as non-root user") have not been run, all docker and docker-compose commands should be run by the super user (root), or as sudo.
pt_br: Se as etapas de pós instação (mais especificamente de "Manage docker as non-root user") não foram executadas, todos os comandos do docker e docker-compose devem ser executados com super usário (root) ou com sudo.

source: Up to date information and installation procedures for the docker-compose can be found at the project's documentation:
pt_br: Informações atualizadas do processo de instalação do docker-compose podem ser encontradas na documentação do seu projeto:

source: Installation
pt_br: Instalação

source: To setup the environment, merely clone the deployment repository and run the commands below.
pt_br: Para configurar o ambiente, simplesmente clone o repositório de implantação e execute os comandos abaixo.

source: The docker-compose enabled deployment scripts and configuration repository can be found at:
pt_br: Os scripts para implantação e configuração via docker-compose podem ser encontrados no repositório:

source: or as git clone command:::
pt_br: ou utilizando o comando de clone do git: ::

source: Once the repository is properly cloned, select the version to be used by checking out the appropriate tag (do notice that the tagname has to be replaced): ::
pt_br: Uma vez que o repositório tenha sido corretamente clonado, escolha a versão que será utilizada. Para isto configure o repositório git para apontar para a tag apropriada (note que o tag name tem que ser substituído): ::

source: That done, the environment can be brought up by: ::
pt_br: Finalizado, pode-se subir o ambiente: ::

source: To check individual container status, docker's commands may be used, for instance: ::
pt_br: Para verificar o estado de cada container, pode-se utilizar comandos do docker como, por exemplo: ::

source: All docker, docker-compose commands may need sudo to work.
pt_br: Todos os comandos do docker e docker-compose podem precisar de sudo para funcionar.

source: To allow non-root users to manage docker, please check docker's documentation:
pt_br: Para permitir que usuários não-root utilizem o docker, por favor verifique a documentação do docker:

source: Configuration
pt_br: Configuração

source: Once the environment is up, a few configuration steps are required to make it operational.
pt_br: Uma vez que o ambiente esteja rodando, algumas configurações são necessárias para torná-lo operacional.

source: API gateway configurarion
pt_br: Configuração do API gateway

source: In order to guarantee the proper mapping of API into processing services, the API gateway must be configured. To do so, please run kong_config.sh, present at the root of the repository. ::
pt_br: O API gateway precisa ser configurado para garantir um mapeamento adequado da API nos serviços de processamento da dojot. Para isso, execute o script kong_config.sh, presente na raiz do repositório. ::

source: User creation
pt_br: Criação de usuário

source: To be able to use the system's web front-end and make API calls, a user must be created. To create a first `admin` user, the following script can be run on the host machine of the platform (that is, the machine where docker-compose was run). The script is located at the root of the repository. ::
pt_br: Para que seja possível a utilização da interface gráfica do sistema assim como chamadas via API, um usuário precisa ser configurado. Para criar o primeiro usuário `admin`, o seguinte script pode ser executado na máquina que hospeda a plataforma (isto é, na máquina o onde o docker-compose está rodando). O script está na raiz do repositório. ::

source: Installation Guide - Google Cloud Platform
pt_br: Guia de Instalação - Google Cloud Platform

source: This document provides instructions on how to prepare a Google Cloud environment for a dojot deployment using Kubernetes as the orchestrator.
pt_br: Este documento fornece instruções de como preparar um ambiente Google Cloud para uma implantação dojot usando Kubernetes como orquestrador.

source: This document will provide steps for creating a test and assessment environment for those who want to learn and experiment with the dojot platform but prefer to run it on a cloud environment.
pt_br: Este documento fornece passos para criar um ambiente de teste e experimentação para aqueles que desejam aprender e experimentar com a plataforma dojot mas que preferem executá-la em um ambiente de cloud.

source: The steps as presented here can be evolved to real world deployments with proper changes to fulfill your deployment use case
pt_br: Os passos aqui apresentados podem ser evoluídos para um cenário de implantação real com as devidas adaptações para os casos de uso específicos.

source: Creating a Project
pt_br: Criando um projeto

source: To prepare an environment to deploy dojot on the Google Cloud Platform, the first thing that must be done is to create a project for the deployment.
pt_br: Para preparar um ambiente para a implantação do dojot na Google Cloud Platform, a primeira coisa que deve se feita é a criação de um projeto para a implantação.

source: To create a project, go to the page https://console.cloud.google.com/projectcreate and define the new project's name.
pt_br: Para criar um projeto, va para a página https://console.cloud.google.com/projectcreate e defina um novo nome de projeto.

source: Wait until the project creation is complete. Then, go to the page https://console.cloud.google.com/projectselector/home/dashboard, click on the select button and choose the recently created project.
pt_br: Aguarde até que a criação do projeto seja concluída. Então, proceda para apágina https://console.cloud.google.com/projectselector/home/dashboard, clique no botão de seleção e escolha o projeto recém criado.

source: Creating a Cluster
pt_br: Criando um Cluster

source: Having the desired project selected, got to the kubernetes page of the GCP at the link https://console.cloud.google.com/kubernetes/.
pt_br: Tendo selecionado o projeto desejado, vá para a pagina de gerência do Kubernetes da GCP no link https://console.cloud.google.com/kubernetes/.

source: Wait for the Kubernetes Engine to be ready and click on the create cluster button.
pt_br: Espere até que o Kubernetes Engine esteja pronto e clique no botão para criar um cluster.

source: In the cluster creation page, define a name for your cluster and select an appropriate region for your deployment. To create an evaluation and testing environment for dojot a cluster with 3 machines with 1 vCPU is enough for the sake of experimenting with the kubernetes deployment. With the options properly set, click on the create button and wait for the cluster to be created.
pt_br: Na página de criação de cluster, escolha um nome para seu cluster e selecione uma região apropriada para a sua implantação. Para criar um ambiente de avaliação eteste para o dojot, um cluster com 3 máquinas com 1 vCPU é mais do que suficiente para atender o propósito de experimentação com implantações usando Kubernetes. Com as opções selecionadas adequadamente, clique no botão para criar o cluster e aguarde até que a criação seja concluída.

source: Getting the credentials
pt_br: Obtendo credenciais

source: With the kubernetes cluster created, the next step is obtaining the cluster access credentials so your machine is able to access the cluster and proceed with the deployment.
pt_br: Com o cluster de Kubernetes criado, o próximo passo é obter as credenciais de acesso ao cluster de forma que sua máquina seja capaz de acessar remotamente o cluster e proceder com os passos de implantação.

source: On the kubernetes page, on the list of created clusters, locate the cluster you just created, on the right side of it click on the "Connect" button. Copy the first command that is provided and run this on a terminal on your machine, this command will install the credentials. To run this command it is required that the gcloud client is installed and properly configured on your machine. To install this client follow the instructions provided by the google documentation at: https://cloud.google.com/sdk/docs/quickstarts
pt_br: Na página do Kubernetes, na lista de clusteres criados, encontre o cluster que você acabou de criar, logo a sua direita, clique no botão "Connect". Copie o primeiro que é fornecido e execute-o em um terminal na sua máquina, este comando instalará as credenciais. Para executar este comando é necessário que você tenha o cliente gcloud corretamente instalado e devidamente configurado. Para instalar este cliente, siga as instruções conforme fornecidas na documentação do Google Cloud em: https://cloud.google.com/sdk/docs/quickstarts

source: With the credential configured, proceed to the :ref:`Kubernetes Deployment Guide <kubernetes>`
pt_br: Com a configuração devidamente configurada, proceda para :ref:`Guia de Implantação com Kubernetes <kubernetes>`

source: Installation Guide - Kubernetes
pt_br: Guia de Instalação - Kubernetes

source: This document provides instructions on how to create a simple dojot deployment environment on a multi-node environment, using kubernetes as the orchestration platform.
pt_br: Este documento fornece instruções sobre como criar um ambiente simples com a plataforma dojot em um ambiente de múltiplos nós, usando Kubernetes como a plataforma de orquestração.

source: This deployment option as presented in this document is best suited to tests and assessment of the platform, but with the appropriate changes might be evolved for production environments.
pt_br: Esta opção de implantação como é apresentada neste documento é mais indicada para testes e avaliações da plataforma, mas com modificações apropriadas pode ser evoluída para ambientes de produção.

source: This guide has been checked on a Kubernetes cluster with Ceph as the underlying storage infrastructure and it has also been tested on a Kubernetes cluster over the Google Cloud Platform
pt_br: Este guia foi verificado em um cluster Kubernetes utilizando Ceph como a infraestrutura subjacente de armazenamento e também foi testado em um cluster Kubernetes sobre a Google Cloud Platform.

source: This setup has as the first requirement a Kubernetes cluster that is properly configured and running.
pt_br: Este guia tem como primeiro requisito um cluster Kubernetes que esteja funcional e devidamente configurado.

source: The second requirement is a Kubernetes client correctly installed on the machine that will start the deployment process
pt_br: O segundo requisito é que um cliente Kubernetes esteja instalado na máquina de onde o processo de implantação sera executado

source: Kubernetes Cluster
pt_br: Cluster Kubernetes

source: For this guide it is advised that you already have a functioning cluster.
pt_br: Para proceder com este guia é recomendado que você já possua um cluster funcional.

source: If you desire to prepare a Kubernetes cluster from scratch, up to date information and installation procedures can be found at the project's documentation:
pt_br: Se você deseja preparar um cluster Kubernetes do zero, informações atualizadas sobre o procedimento de instalação podem ser encontradas na documentação do projeto:

source: Persistent Storage
pt_br: Armazenamento Persistente

source: To make sure that all the data from the containers running databases is persisted when containers fail or are moved to different nodes of the Kubernetes environment it is necessary to attach persistent storage to the database pods.
pt_br: Para garantir que todos os dados dos contêineres que executam bancos de dados está sendo persistida quando estes contêineres falham ou são movidos para diferentes nós do ambiente Kubernetes, é necessário anexar armazenamento persistente aos Pods e banco de dados.

source: Kubernetes requires that an infrastructure for persistent storage already exists on the cluster. As an example for how to configure your persistent storage we provide files for two different kind of deployments, the first is for a local deployment where a Ceph Cluster is used as storage backend, more information on Ceph may be found at: http://ceph.com/. The second example is based on a Google Cloud deployment and use the existing persistent storage services that are provided by Google Cloud. If you're deploying dojot using Kubernetes to a different cloud provider, some adjustments to fit the different deployments might be necessary.
pt_br: O Kubernetes precisa que a infraestrutura de armazenamento persistente já exista no cluster. Como exemplo sobre como você pode configurar seu armazenamento persistente nós fornecemos arquivos para dois tipos diferentes de implantação, o primeiro se refere a um deploy local onde um cluster Ceph é utilizado como backend de armazenamento, mais informações sobre o Ceph podem ser encontrados em: http://ceph.com/ . O segundo exemplo é baseado em uma implantação na Google Cloud Platform e faz uso dos serviços de armazenamento persistentes que são fornecidos pela Google Cloud. Se você estiver fazendo a implantação do dojot utilizando Kubernetes em um provedor de nuvem diferente dos citados aqui, alguns ajustes as configurações de armazenamento podem ser necessárias para se adaptar às diferentes possibilidades de ambientes.

source: Information about the currently supported persistent storage for Kubernetes can be found at: https://kubernetes.io/docs/concepts/storage/persistent-volumes/#types-of-persistent-volumes
pt_br: Informações sobre os tipos de armazenamento persistente que são atualmente suportados pelo Kubernetes podem ser encontradas em: https://kubernetes.io/docs/concepts/storage/persistent-volumes/#types-of-persistent-volumes

source: Kubernetes Client
pt_br: Cliente Kubernetes

source: To install the Kubernetes client on your machine before proceeding with this guide, follow the proper instructions as presented on the Kubernetes documentation:
pt_br: Para instalar o cliente Kubernetes na sua máquinas antes de prosseguir com as instruções deste guia, siga as instruções como apresentadas na documentação do Kubernetes:

source: Also, verify that your client is capable of connecting to the cluster.
pt_br: Além disso, verifique que o seu cliente é capaz de se conectar ao cluster.

source: For providing access for a local cluster, follow the documentation below:
pt_br: Para fornecer acesso para um cluster local, siga a documentação em:

source: If the Kubernetes cluster is running on a specific cloud platform like Google Cloud, follow the steps as presented by your cloud provider.
pt_br: Se o cluster Kubernetes está sendo executado em alguma plataforma de cloud específica como o Google Cloud por exemplo, siga os passos fornecidos pelo seu provedor de cloud.

source: Deployment
pt_br: Implantação

source: To deploy dojot to a Kubernetes environment, we provide sample scripts and templates for two kinds of clusters. The examples are for an environment comprised by Kubernetes with Ceph for storage, the second is a deployment to a Kubernetes environment running on Google Cloud Platform.
pt_br: Para implantar o dojot em ambiente Kubernetes, nós fornecemos scripts e modelos de exemplo para dois tipos de cluster. Os exemplos são para um ambiente composto por um Kubernetes com armazenamento em Ceph e para um ambiente Kubernetes sobre a plataforma de Cloud do Google.

source: For both environment it is necessary to download the scripts and templates before performing the deployment.
pt_br: Para ambos os ambientes é necessário fazer o download dos scripts e modelos antes de prosseguir com a implantação do dojot

source: To download the required files using git, run the following command: ::
pt_br: Para fazer o download dos arquivos necessários utilizando o git, siga oscomandos a seguir: ::

source: or, to download a compressed zip file containing the data, use the following link: https://github.com/dojot/kubernetes/archive/master.zip
pt_br: ou, para fazer o download de um arquivo comprimido zip contendo os arquivos necessários, use o link a seguir: https://github.com/dojot/kubernetes/archive/master.zip

source: Enter the downloaded folder and follow the instructions in the section that corresponds to your specific environment.
pt_br: Entre na pasta que contém o conteúdo do download e siga as instruções da sessão correspondente ao tipo de ambiente que você utilizará para a implantação.

source: All the instructions provided in the following sections assume that the commands are being run on a linux terminal.
pt_br: Todas as instruções fornecidas nas sessões seguintes assumem que os comandos estão sendo executados em terminais linux.

source: To deploy dojot to a Kubernetes cluster running over Google Cloud the only requirements are that you have your cluster configured on Google Cloud and your local Kubernetes client is properly configured to access that cloud.
pt_br: Para fazer a implantação do dojot em um cluster Kubernetes sobre a plataforma de nuvem do Google, os únicos requisitos são que seu cluster esteja criado e que seu cliente Kubernetes local esteja adequadamente configurado para acessar a núvem.

source: To execute the script to deploy to Google Cloud just run the following command on the terminal: ::
pt_br: Para executar o procedimento e executar o dojot na nuvem do Google, rode o comando a seguir no terminal: ::

source: The selected parameters set the type of storage to be used as GCP persistent storage and also set the external access to use the load balancers as provided by the Google Cloud Platform.
pt_br: Os parâmetros selecionados definem o tipo de armazenamento que será usado como GCP e também definem que o acesso externo será feito através de um balanceador de tráfego da própria plataforma do Google.

source: Just wait until the script finishes running and then check for when all the pods have finished starting, to check if all the pods are running correctly, run the command below and verify that all pods have reached a "Running" state, this may take a while and retries for some pods. ::
pt_br: Aguarde até que a execução do script seja finalizada e então aguarde até que todos os pods tenham completado sua inicialização, para verificar se os pods foram inicializados corretamente, execute o comando abaixo e veja se todos os Pods chegaram ao estado "Running", pode levar um tempo para que isso aconteça e alguns Pods podem precisar de múltiplas tentativas até que isso aconteça. ::

source: After all the pods are running, run the following command in order to obtain the public ip address that is being used by the load balancer ::
pt_br: Depois que todos os Pods estão rodando corretamente, siga os comandos a seguir para obter o endereço IP público que está sendo utilizado pelo balanceador de tráfego: ::

source: The command will return the external ip used by the load balancer, with this IP you can access that ip using any browser at http://EXTERNAL_IP
pt_br: Este comando retornará o IP público que está sendo exposto pelo balanceador de tráfego, utilizando este IP você poderá acessar a plataforma em qualquer browser através do endereço http://IP_PUBLICO/

source: The initial user and password are admin and admin.
pt_br: Os usuários e senhas iniciais são "admin" e "admin".

source: Cluster with Ceph
pt_br: Cluster com Ceph

source: To deploy dojot to a Kubernetes Cluster where you have as persistent storage infrastructure a Ceph Cluster you will need the configuration file for accessing Ceph.
pt_br: Para fazer a implantação de um cluster Kubernetes onde a infraestrutura de persistência que será utilizada é um cluster Ceph, você precisará do arquivo de configuração para acessar o Ceph.

source: Also you will need to set some information regarding your Ceph cluster on the manifest files.
pt_br: Além disso, você precisará configurar algumas informações sobre seu cluster Ceph nos manifestos de configuração de armazenamento.

source: Edit the file "manifests/STORAGE/CEPH/rbd-provisioner.yaml" and change the values of the pool and the userId to match those of your specific environment. Also it is necessary to get the key for the admin user and the client user. With this keys at hand, convert then to base 64, this may be done at your terminal running the command: ::
pt_br: Edite o arquivo "manifests/STORAGE/CEPH/rbd-provisioner.yaml" e mude os valores "pool" e "userId" para corresponder com aqueles do seu ambiente. Além disso é necessário obter a chave para o usuário administrador e para o usuário cliente. Com essas chaves em mãos, converta-as para base 64, isto pode ser feito no seu terminal utilizando o comando: ::

source: The value that is returned must be added to the "manifests/STORAGE/CEPH/ceph-secret-admin.yaml" and "manifests/STORAGE/CEPH/ceph-secret-user.yaml" respectively at the field key.
pt_br: O valor retornado pelo comando deve ser adicionado ao arquivo "manifests/STORAGE/CEPH/ceph-secret-admin.yaml" e "manifests/STORAGE/CEPH/ceph-secret-user.yaml" respectivamente no campo "key".

source: Also you may choose to deploy with a load balancer if your infrastructure provide one, otherwise you may deploy selecting a public ip of one of the kubernetes cluster nodes as the point of access for the environment.
pt_br: Além disso você pode escolher por fazer a implantação utilizando um balanceador de tráfego se sua infraestrutura prover um, senão o deploy pode ser feito escolhendo-se um IP Público de algum dos nós do seu cluster Kubernetes para ser utilizado como ponto de acesso externo para o ambiente dojot.

source: To execute the script and deploy with Ceph and a public ip just run the following command on the terminal: ::
pt_br: Para executar o script e fazer a implantação do deploy com Ceph e um IP público execute o comando a seguir no seu terminal: ::
