Repository: dojot/docs
Catalog: source/locale/*/LC_MESSAGES/installation-guide.po
Languages: pt_br

source: Installation Guide
pt_br: Guia de instalação

source: This page contains information about how to deploy dojot using Docker compose and Kubernetes.
pt_br: Esta página contém informação de como instalar a dojot utilizando o docker-compose e o Kubernetes.

source: Hardware requirements
pt_br: Requisitos de hardware

source: The estimated hardware requirements for 500 devices with updates every 15s are:
pt_br: Os requisitos de hardware estimados para 500 dispositivos com atualizações a cada 15s são:

source: Hardware requirements for 500 devices
pt_br: Requisitos de hardware para 500 dispositivos

source: Deployment
pt_br: Implantação dojot

source: Free disk space
pt_br: Espaço livre em disco

source: 4 Cores
pt_br: 4 Núcleos

source: 2 Cores
pt_br: 2 Núcleos

source: In addition, you need:
pt_br: Além disso, são necessários:

source: Network access
pt_br: Acesso à rede

source: The following ports should be opened:
pt_br: As seguintes portas devem estar abertas:

source: TCP (incoming connections): 1883 (MQTT), 8000 (web interface access)
pt_br: TCP (conexões de entrada): 1883 (MQTT), 8883 (MQTT seguro, se utilizado), 8000 (acesso à interface web)

source: TLS (incoming connections): 8883 (Secure MQTT if used)
pt_br: TCP (conexões de entrada): 1883 (MQTT), 8883 (MQTT seguro, se utilizado), 8000 (acesso à interface web)

source: Note: The above cores are approximately 3.5 GHz (x86-64)
pt_br: Nota: Os núcles acima são de aproximadamente 3.5 GHz (x86-64)

source: This document provides instructions on how to create a trivial deployment environment on single host for *dojot*, using docker-compose as the processes orchestration platform.
pt_br: Este documento contém instruções de como criar um ambiente para instalação trivial da dojot em um único host utilizando o docker-compose como o processo de orquestração da plataforma.

source: While very simple, this deployment option is best suited to development and assessment of the platform and should not be used for production environments.
pt_br: Muito simples, esta opção de instalação é a que melhor se adapta para desenvolvimento e verificação da plataforma dojot, mas não é aconselhável para ambientes de produção.

source: This guide has been checked on an Ubuntu 16.04 LTS environment.
pt_br: Este guia foi verificado utilizando-se o sistema operacional Ubuntu 16.04 LTS.

source: The following sections describe all Docker compose dependencies.
pt_br: As seções seguintes descrevem todas as dependências do docker-compose.

source: Docker engine
pt_br: Docker engine (motor do docker)

source: Up to date information and installation procedures for the docker engine can be found at the project's documentation:
pt_br: Informações atualizadas e procedimentos de instalação para o docker engine podem ser encontrados na documentação do projeto:

source: An optional step on the installation and configuration process of docker on any given machine is the setting of who is eligible for creating/spawning docker instances.
pt_br: Um passo adicional no processo de instalação e configuração do docker em um determinado equipamento é definir quem será elegível para criar/iniciar instâncias do docker.

source: Should the post-installation steps (more specifically the "Manage docker as non-root user") have not been run, all docker and docker-compose commands should be run by the super user (root), or as sudo.
pt_br: Caso os passos pós-instalação não tiverem sido executados (mais especificamente o "Manage docker como usuário não-root"), todos os comandos do docker e do docker-compose devem ser executados pelo super usuário (root), ou invocando o sudo.

source: Up to date information and installation procedures for the docker-compose can be found at the project's documentation:
pt_br: Informações atualizadas sobre procedimentos de instalação para o docker-compose podem ser encontradas na documentação do projeto:

source: Installation
pt_br: Instalação

source: To setup the environment, merely clone the deployment repository and run the commands below.
pt_br: Para construir o ambiente, simplesmente clone o repositório e execute os comandos abaixo.

source: The docker-compose enabled deployment scripts and configuration repository can be found at:
pt_br: O repositório com os scripts de instalação e configuração do docker-compose podem ser encontrados em:

source: or as git clone command:::
pt_br: ou com o comando git clone::

source: Once the repository is properly cloned, select the version to be used by checking out the appropriate tag (do notice that the tagname has to be replaced): ::
pt_br: Uma vez que o repositório esteja propriamente clonado, selecione a versão a ser utilizada por meio da tag apropriada (note que o tagname deve ser substituído): ::

source: For instance: ::
pt_br: Por exemplo: ::

source: Or if you're brave enough: ::
pt_br: Ou se você for muito ousado: ::

source: That done, the environment can be brought up by: ::
pt_br: Feito isso, o ambiente pode ser iniciado assim: ::

source: To check individual container status, docker's commands may be used, for instance: ::
pt_br: Para verfificar o estado de um container individual, comandos do docker podem ser utilizados, como por exemplo: ::

source: All docker, docker-compose commands may need sudo to work.
pt_br: Todos os comandos para docker e docker-compose podem requerer credenciais de super usuário (root) ou sudo.

source: To allow non-root users to manage docker, please check docker's documentation:
pt_br: Para permitir usuários "não-root" gerenciar o docker, confira a documentação do docker:

source: Usage
pt_br: Utilização

source: The web interface is available at ``http://localhost:8000``. The user is ``admin`` and the password is ``admin``. You also can interact with platform using the :ref:`Components and APIs`.
pt_br: A interface web está disponível em ``http://localhost:8000``. O usuário é ``admin`` e a senha é ``admin``. Você também pode interagir com a plataforma utilizando o :ref:`Components and APIs`.

source: Read the :doc:`using-api-interface` and :doc:`using-web-interface` for more information about how to interact with the platform.
pt_br: Leia o :doc:`using-api-interface` e :doc:`using-web-interface` para maiores informações sobre como interagir com a plataforma dojot.

source: This deployment option when properly configured can be used for creating production environments.
pt_br: Esta opção de implantação, quando configurada corretamente, pode ser usada para criar ambientes de produção.

source: The following sections describe all dependencies and steps required for this deployment.
pt_br: As seções a seguir descrevem todas as dependências e etapas necessárias para esta implantação.

source: Kubernetes Cluster
pt_br: Cluster Kubernetes

source: For this guide it is advised that you already have a working K8s cluster.
pt_br: Para este guia, é recomendável que você já tenha um cluster K8s funcionando.

source: If you need to build a Kubernetes cluster from scratch, up to date information and installation procedures can be found at `Kubernetes setup documentation`_.
pt_br: Se você precisar criar um cluster Kubernetes do zero, informações atualizadas e procedimentos de instalação podem ser encontrados na `documentação de instalação do Kubernetes`_.

source: Kubernetes Requirements
pt_br: Kubernetes Requisitos

source: The Kubernetes supported version is between **v1.11** and **v1.15** .
pt_br: A versão suportada pelo Kubernetes é entre **v1.11** e **v1.15**.

source: Access to Docker Hub repositories
pt_br: Acesso aos repositórios do Docker Hub

source: (optional) a storage class that will be used for persistent storage
pt_br: (opcional) uma classe de armazenamento que será usada para armazenamento persistente

source: dojot Deployment
pt_br: Implantação dojot

source: To deploy dojot to Kubernetes it is advised the use of ansible playbooks developed for dojot. The playbooks and all the related code can be found on the repository `Ansible dojot`_.
pt_br: Para implantar o dojot no Kubernetes, é recomendável o uso de *playbooks* *ansible* desenvolvidos para o dojot. Os manuais e todo o código relacionado podem ser encontrados no repositório `*Ansible* dojot`_.

source: The following steps will describe how to use this repository and its playbooks.
pt_br: As etapas a seguir descreverão como usar este repositório e o *ansible*.

source: 1. Cloning the repository
pt_br: 1. Clonando o repositório

source: The first deployment step is cloning the repository. To do so, execute the command: ::
pt_br: A primeira etapa da implantação é a clonagem do repositório. Para fazer isso, execute o comando: ::

source: 2. Installing dependencies
pt_br: 2. Instalando dependências

source: The next step is installing the dependencies for running the ansible playbook, this dependencies include ansible itself with other modules that will be used to parse templates and communicate with kubernetes.
pt_br: A próxima etapa é instalar as dependências para executar o *ansible*, essas dependências incluem o próprio *ansible* com outros módulos que serão usados para analisar modelos e se comunicar com os kubernetes.

source: Enter the folder where the repository was downloaded and install the pip packages with the following commands: ::
pt_br: Digite a pasta em que o repositório foi baixado e instale os pacotes pip com os seguintes comandos:

source: 3. Configuring the inventory
pt_br: 3. Configurando o inventário

source: For deploying kubernetes with ansible, it is necessary to model your desired environment on an ansible inventory.
pt_br: Para implantar o kubernetes com *ansible*, é necessário modelar o ambiente desejado em um inventário *ansible*.

source: In the repository there is an '*inventory*' folder containing an example inventory called '*example_local*' that can be used as the starting point to creating the real environment inventory.
pt_br: No repositório, há uma pasta 'inventory' que contém um exemplo de inventário chamado 'example_local' que pode ser usado como ponto de partida para criar o inventário do ambiente real.

source: The first file that requires changes is the hosts.yaml. This file describes the nodes that will be accessed by ansible to perform the deployment. As the dojot deployment is done directly to K8s, only a node with access to the kubernetes cluster is actually required.
pt_br: O primeiro arquivo que requer alterações é o hosts.yaml. Este arquivo descreve os nós que serão acessados pelo *ansible* para executar a implantação. Como a implantação do dojot é feita diretamente nos K8s, apenas um nó com acesso ao cluster kubernetes é realmente necessário.

source: The node that will access the cluster might be a kubernetes cluster node that is accessible via SSH or event your local machine if it can reach the kubernetes cluster with a configuration file.
pt_br: O nó que acessará o cluster pode ser um nó de cluster kubernetes acessível via SSH ou evento sua máquina local se puder alcançar o cluster kubernetes com um arquivo de configuração.

source: On the example file, the access is done via a local node, where the ansible script is executed. This node is described as localhost in the hosts item of the group **all**.
pt_br: No arquivo de exemplo, o acesso é feito através de um nó local, onde o *script* *ansible* é executado. Este nó é descrito como localhost no item de hosts do grupo **all**.

source: These same nodes must be added as children of the group dojot-k8s.
pt_br: Esses mesmos nós devem ser adicionados como filhos do grupo dojot-k8s.

source: To configure a local access on the hosts file, follow the example below:
pt_br: Para configurar um acesso local no arquivo hosts, siga o exemplo abaixo:

source: To configure remote access via ssh to a node of the cluster, follow this other example:
pt_br: Para configurar o acesso remoto via ssh para um nó do cluster, siga este outro exemplo:

source: The next step is configuring the mandatory and optional variables required for deploying dojot.
pt_br: A próxima etapa é configurar as variáveis obrigatórias e opcionais necessárias para implementar a dojot.

source: There is a document describing each of the variables that can be configured at `Ansible dojot variables`_.
pt_br: Há um documento descrevendo cada uma das variáveis que podem ser configuradas nas `variáveis *Ansible* dojot`_.

source: This variables must be set for the group '*dojot-k8s*', to do so set their values on the file dojot.yaml on the folder '**group_vars/dojot-k8s/**'
pt_br: Essas variáveis devem ser definidas para o grupo *'dojot-k8s*', para isso, defina seus valores no arquivo dojot.yaml na pasta '**group_vars/dojot-k8s/**'

source: 4. Executing the deployment playbook
pt_br: 4. Executando a implantação

source: Now that the inventory is set, the next step is executing the deployment playbook.
pt_br: Agora que o inventário está definido, a próxima etapa é executar o *playbook* de implantação

source: To do so, run the following command:
pt_br: Para fazer isso, execute o seguinte comando:

source: Wait for the playbook execution to finish without errors.
pt_br: Aguarde a execução do *playbook* terminar sem erros.

source: 5. Accessing the deployed dojot environment
pt_br: 5. Acessando o ambiente dojot implantado

source: Dojot access will be set using NodePorts, to view the proper ports to access the environment it is necessary to check service configuration.
pt_br: O acesso a Dojot será definido usando NodePorts. Para visualizar as portas apropriadas para acessar o ambiente, é necessário verificar a configuração do serviço.

source: This command will return the port used for external access to both the REST API and GUI via kong and the MQTT port via iotagent-mosca.
pt_br: Este comando retornará a porta usada para acesso externo à API REST e à GUI via kong e à porta MQTT via iotagent-mosca.
