Repository: dojot/docs
Catalog: source/locale/*/LC_MESSAGES/install.po
Languages: pt_br

source: Wait while the script starts the deployment, you will be prompted for two parameters during the deployment, the path for the ceph configuration file and the desired public ip. Enter this parameters and type enter when prompted.
pt_br: Aguarde até que o script conclua a criação do ambiente dojot, você receberá requisições por dois parâmetros ao longo da execução do script, o primeiro será o caminho para o arquivo de configuração do Ceph e o segundo será o IP Público desejado. Entre estes parâmetros quando solicitado e aperte enter para prosseguir.

source: After all the pods are runninf, you can access your dojot deployment using the public ip that was defined http://PUBLIC_IP
pt_br: Depois que todos os pods estão rodando, você poderá acessar o seu ambiente dojot usando o IP Público que foi definido, através do link: http://IP_PUBICO/
