Repository: dojot/docs
Catalog: source/locale/*/LC_MESSAGES/load-testing-dojot-platform.po
Languages: pt_br

source: Load testing Dojot platform
pt_br: Aplicando teste de carga na plataforma Dojot

source: In this tutorial, will be shown how to run a load test using the dojot's Locust implementation.
pt_br: Neste tutorial será demonstrado como rodar um teste de carga usando a implementação do Locust feita para a dojot.

source: Locust was created to work with VerneMQ. Tests with Mosca are not guaranteed to work.
pt_br: A implementação do Locust foi feita para realizar testes com o VerneMQ. Testes com o Mosca não têm garantia de funcionamento.

source: Table of Contents
pt_br: Índice

source: Setting the environment up
pt_br: Preparando o ambiente

source: First of all, you will need a running dojot environment. Check the :doc:`./installation-guide` for more info.
pt_br: Primeiramente, você precisa de um ambiente dojot rodando. Verifique o :doc:`./installation-guide` para mais informações.

source: Enter in Locust directory:
pt_br: Entre na pasta do Locust:

source: Running a simple test
pt_br: Rodando um teste simples

source: In this section, it will be shown how to configure and run Locust, and also how to generate certificates with the generate_certs script in order to execute the load test. This is a simple test where will be created 100 clients to send messages to dojot.
pt_br: Nesta seção, será demonstrado como configurar e rodar o Locust, além de como gerar certificados com o script ``generate_certs`` que serão utilizados para executar o teste de carga. Este é um teste simples, onde serão criados 100 clientes que irão enviar mensagens à dojot.Antes de rodar os testes

source: Configuration
pt_br: Configuração

source: Make sure to check the README included in Locust directory to learn more about the architecture and configurations. In this tutorial we will only cover the most important configurations.
pt_br: Verifique o README incluído no diretório do Locust para aprender mais sobre a arquitetura e configurações. Neste tutorial serão cobertas somente as configurações mais importantes.

source: Before running the tests, there must be changed some configurations in Locust docker compose files.
pt_br: Antes de rodar os testes, algumas configurações nos arquivos de docker compose do Locust precisam ser alteradas.

source: Open ``Docker/docker-compose-master.yml`` and change the following environment variables:
pt_br: Abra o arquivo ``Docker/docker-compose-master.yml`` e mude as seguintes variáveis de ambiente:

source: Open ``Docker/docker-compose-slave.yml`` and change the following environment variables:
pt_br: Abra o arquivo ``Docker/docker-compose-slave.yml`` e mude as seguintes variáveis de ambiente:

source: We are assuming you are running the master and the slave in the same machine, i.e. in *non-distributed mode*. Later on will be shown how to distribute slaves between multiple machines.
pt_br: Estamos assumindo que você está rodando o *master* e o *slave* na mesma máquina, i.e. no *modo não distribuído*. Mais à frente será mostrado como distribuir os *slaves* em múltiplas máquinas.

source: Open ``Docker/scripts/generate_certs/docker-compose.yml`` and change the following environment variables:
pt_br: Abra o arquivo ``Docker/scripts/generate_certs/docker-compose.yml`` e mude as seguintes variáveis de ambiente:

source: Generating the certificates
pt_br: Gerando os certificados

source: As said before, the communication from Locust to dojot is secure, then, it is necessary to use certificates.
pt_br: Como dito anteriormente, a comunicação entre Locust e dojot é segura, portanto é necessário o uso de certificados.

source: There are two ways of simulating devices: you can create fake devices (will not show up in dojot's GUI) or real devices. In this part of the tutorial, we will create real devices, so you can check the sent messages in the GUI.
pt_br: Existem duas maneiras de se simular os dispositivos: você pode criar dispositivos falsos (que não aparecerão na GUI da dojot) ou dispositivos reais. Nesta parte do tutorial serão criados os dispositivos reais para que você possa verificar a chegada das mensagens na GUI.

source: Before running the script, we need to initialize the Locust master. Inside Locust repository, run:
pt_br: Antes de rodar o script, é necessário inicializar o Locust master. Dentro do repositório do Locust, rode:

source: After its initialization, run the ``generate_certs`` script docker compose and enter in it:
pt_br: Após sua inicialização, rode o contêiner do script ``generate_certs`` e entre nele:

source: Create the devices in dojot:
pt_br: Crie os dispositivos na dojot:

source: You can now check that the devices are created in dojot.
pt_br: Agora é possível verificar que os dispositivos foram criados na dojot.

source: : Some of the devices that ``generate_certs`` created in dojot.
pt_br: : Alguns dos dispositivos que o ``generate_certs`` criou na dojot.

source: : The template used by ``generate_certs`` to create devices.
pt_br: : O *template* usado pelo ``generate_certs`` para criar os dispositivos.

source: Generate the certificates for them:
pt_br: Gere os certificados para eles:

source: The certificates are exported to the ``cert`` directory. Now the test can be initialized!
pt_br: Os certificados são exportados para a pasta ``cert``. Agora o teste pode ser inicializado!

source: Initializing the slaves
pt_br: Inicializando os slaves

source: Locust master does nothing by itself. The one who does all the work of sending requests is the Locust slave container. Initialize it by running:
pt_br: O Locust *master* não faz nada por si só. Quem realmente faz todo o trabalho de enviar as requisições é o contêiner do Locust *slave*. Para inicializá-lo, rode:

source: You should see a message in the Locust master log saying that one slave has connected to him.
pt_br: Você deve ver no Locust *master* uma mensagem dizendo que há um *slave* conectado a ele.

source: Running the test
pt_br: Rodando o teste

source: You are all set to begin the test. To run it, you need to access the Locust interface in your browser in ``localhost:8089`` (supposing you are running Locust master in ``localhost``).
pt_br: Está tudo pronto para inicializar o teste. Para rodá-lo, é preciso acessar a interface do Locust em seu navegador no endereço ``localhost:8089`` (supondo que você está rodando o Locust *master* no ``localhost``).

source: Type ``100`` in ``Number of users to simulate``, ``10`` in ``Hatch rate`` and click in ``Start swarming``. This tells Locust to run 100 clients, creating 10 of them per second.
pt_br: Digite ``100`` em ``Number of users to simulate``, ``10`` em ``Hatch rate`` e clique em ``Start swarming``. Isso dirá ao Locust para rodar 100 clientes, criando 10 deles por segundo.

source: : Configuring Locust to run the clients.
pt_br: : Configurando o Locust para rodar os clientes.

source: The default configuration is for every client to send a message each 30 seconds, so you'll have to wait a moment for the messages to arrive at dojot.
pt_br: A configuração padrão dita que cada cliente mande uma mensagem a cada 30 segundos, então você deverá aguardar um pouco para ver as mensagens chegando na dojot.

source: : Locust statistics after running for a few minutes.
pt_br: : As estatísticas do Locust após rodar os testes por alguns minutos.

source: You can go to dojot and see that the messages are arriving there.
pt_br: Você pode ir até a dojot e ver as mensagens chegando por lá.

source: : An example device receiving messages.
pt_br: : Um dispositivo de exemplo recebendo mensagens.

source: Running a distributed test
pt_br: Rodando um teste distribuído

source: For small tests, the forementioned procedure might be sufficient, but if you really want to force dojot, you might encounter some barriers when using only one slave and/or one machine. As a solution for this problem, Locust has a **distributed mode**, permitting you to initialize multiple slaves in multiple machines, limiting Locust performance to the amount of processing power (and budget!) you got.
pt_br: Para testes pequenos, o procedimento supracitado deve ser o suficiente, mas se você deseja realmente forçar a dojot, barreiras serão encontradas ao usar somente um *slave* e/ou uma máquina. Para solucionar este problema, o Locust provê o **modo distribuído**, permitindo a inicialização de múltiplos *slaves* em múltiplas máquinas, limitando o desempenho do Locust ao montante de poder de processamento (e orçamento!) que você tem.

source: We are going to use two virtual machines to run 4 slaves (2 in each VM) and 1 master (in one of them) to create 1,000 fake devices. We will refer to the machine with the master as **primary** and the other as **secondary**.
pt_br: Serão utilizadas duas máquinas virtuais rodando 4 *slaves* (2 em cada VM) e 1 *master* (em uma das VMs) para criar os 1.000 dispositivos falsos. Vamos nos referir à máquina com o *master* como **primária** e à outra como **secundária**.

source: There is no correlation between the chosen numbers: the amount of clients that each slave supports depends on various variables, such as the number of available CPU cores.
pt_br: Não há uma correlação entre os números escolhidos: o número de clientes que cada *slave* suporta é dependente de diversas variáveis, como o número de núcleos de CPU disponíveis.

source: We advice you to run 1 slave per CPU core you have in the machine, i.e. if you have a VM with 4 CPUs, run 4 slaves.
pt_br: Recomendamos que você rode 1 *slave* por núcleo da CPU de sua máquina, i.e. se você tem uma VM com 4 CPUs, rode 4 *slaves*.

source: Configuration for the distributed case
pt_br: Configuração para o modo distribuído

source: Before running the tests, there must be changes to be made in some Locust docker compose files. Note that you must clone the dojot repository in each machine that you will use for Locust.
pt_br: Antes de rodar os testes, há mudanças a serem feitas nos docker compose do Locust. Note que você deve clonar o repositório da dojot em cada máquina em que o Locust rodará.

source: Since the configurations can be the same for the slaves and the generate_certs script, you can share them between machines by using ``sshfs``. Assuming you are in the Locust directory in the secondary machine, run the following command:
pt_br: Como as configurações podem ser as mesmas para os *slaves* e para o script *generate_certs*, você pode os compartilhar entre máquinas usando o ``sshfs``. Assumindo que você esteja na pasta do Locust na máquina secundária, rode o comando:

source: Check the `sshfs`_ documentation for more details.
pt_br: Verifique a documentação do `sshfs`_ para mais detalhes.

source: Open ``Docker/docker-compose-master.yml`` in the primary machine and change the following environment variables:
pt_br: Abra o arquivo ``Docker/docker-compose-master.yml`` na máquina primária e mude as seguintes variáveis de ambiente:

source: As you can see, the configurations have changed a little bit, with the changes being only about the master and Redis location.
pt_br: Como pode-se ver, as configurações mudaram pouco, sendo que as principais mudanças são somente na localização do Redis e do *master*.

source: Generating certificates
pt_br: Gerando os certificados

source: In this part of the tutorial, we will create fake devices that, unlike in the simple test, won't appear in dojot GUI.
pt_br: Nesta parte do tutorial, serão criados dispositivos falsos que, ao contrário do teste simples, não aparecerão na GUI da dojot.

source: Before running the script, we need to initialize the Locust master. Inside Locust directory in your **primary** machine, run:
pt_br: Antes de rodar o script, precismos inicializar o Locust *master*. Dentro da pasta do Locust na máquina primária, rode:

source: After its initialization, initialize the docker compose ``generate_certs`` script in the **primary** machine and enter in it:
pt_br: Após a inicialização, rode o docker compose do ``generate_certs`` na máquina **primária** e entre nela:

source: Create the certificates:
pt_br: Crie os certificados:

source: The fake devices are simulated as certificates.
pt_br: Os dispositivos falsos são simulados como certificados.

source: Now go to your **secondary** machine, initialize the ``generate_certs`` and inside it, run:
pt_br: Agora entre em sua máquina **secundária**, inicialize o ``generate_certs`` e, dentro dele, rode:

source: Since the certificates are stored in Redis, you can simply export them with the shown command in any machine, preventing the tedious job of copying in each VM the ``cert`` directory with the certificates.
pt_br: Como os certificados são armazenados no Redis, você pode simplesmente exportá-los com o comando mostrado em qualquer máquina, prevenindo o trabalho tedioso de copiar em cada VM a pasta ``cert`` com os certificados.

source: Slave initialization
pt_br: Inicialização do slave

source: Run in your **primary** and **secondary** machines:
pt_br: Rode em suas máquinas **primária** e **secundária**:

source: This command creates two Locust slave containers in each machine. You should see in the Locust master log a message for each slave that connects to it.
pt_br: Este comando criará dois contêineres do Locust *slave* em cada máquina. Você deverá notar no Locust *master* mensagens confirmando a conexão de cada *slave*.

source: Running the distributed test
pt_br: Rodando o teste distribuído

source: We are all set to begin the test. To run it, you need to access the Locust interface in your browser in the Locust master location, e.g.: ``localhost:8089``.
pt_br: Está tudo pronto para a realização do teste. Para iniciá-lo, você deve acessar a interface do Locust no seu navegador através do domínio do Locust *master*, e.g. ``localhost:8089``.

source: Type ``1000`` in ``Number of users to simulate``, ``10`` in ``Hatch rate`` and click in ``Start swarming``. This tells Locust to run 1,000 clients, creating 10 of them per second.
pt_br: Digite ``1000`` em ``Number of users to simulate``, ``10`` em ``Hatch rate`` e clique em ``Start swarming``. Isso dirá ao Locust para rodar 1.000 clientes, criando 10 deles por segundo.

source: Using Grafana's Locust dashboard
pt_br: Usando o dashboard do Locust no Grafana

source: The Locust web interface is easy and simple to use, but there are some downsides. The major one is the persistence: The history data will be deleted as soon as you close or refresh the page.
pt_br: A interface web do Locust é simples e fácil de se usar, porém ela tem alguns pontos negativos. O maior deles é a persistência de dados: os dados do histórico são apagados assim que você fecha ou atualiza a página.

source: To solve this problem, we chose to add the Locust Exporter image to the master docker compose file, allowing us to export all of its metrics in a Prometheus-compatible format. That way we can persist this information in Prometheus and centralize all the dashboards in Grafana. Unfortunately, we still need the Locust web interface to initialize tests.
pt_br: Para resolver este problema, foi adicionada a imagem Locust Exporter no docker compose do Locust *master*, permitindo a exportação das métricas em um formato compatível com o Prometheus. Desta forma, é possível armazenar estas informações no Prometheus e centralizar todos os dashboards no Grafana. Infelizmente ainda é necessário acessar a interface web do Locust para começar o teste.

source: Since the Grafana/Prometheus stack is available only in the Kubernetes installation, this part is not applicable to docker compose installations. We encourage you to check the :doc:`./installation-guide` for more information on dojot's installation methods.
pt_br: Como a stack Grafana/Prometheus só está disponível na instalação por meio de Kubernetes, esta seção não é aplicável para a instalação por meio de docker compose. Nós o encorajamos a verificar o :doc:`./installation-guide` para mais informações sobre os métodos de instalação da dojot.

source: Ansible configuration
pt_br: Configuração do Ansible

source: You need to decide where your Locust master will be beforehand to be able to initialize the Ansible playbook. The Ansible configurations that you need to change to link Locust Exporter to Prometheus are:
pt_br: Você deve decidir onde o seu Locust *master* estará de antemão antes de rodar o *playbook* do Ansible. As configurações do Ansible que você precisa modificar para conectar o Locust Exporter com o Prometheus são:

source: Change the IP to the Locust master one and run the playbook. Now you can initialize a (distributed or not) test as shown in the previous sections and you should see the Locust data being sent to Grafana's Locust dashboard.
pt_br: Mude o IP para o do Locust *master* e rode o *playbook*. Agora você pode inicializar um teste (distribuído ou não) como mostrado nas seções anteriores e deverá ver os dados do Locust sendo enviados ao dashboard do Locust no Grafana.

source: : Locust statistics in Grafana - before beginning the test.
pt_br: Estatísticas do Locust no Grafana - antes de começar o teste.

source: : Locust statistics in Grafana - after the test has begun.
pt_br: Estatísticas do Locust no Grafana - depois da inicialização do teste.

source: Requisites for a 100,000 clients test
pt_br: Requisitos para um teste com 100.000 clientes

source: Now that you know how to run distributed tests using Locust, you are able to execute a 100,000 clients test. For this, you will need a lot of computational power and multiple machines, both for dojot and for Locust. The goal is to reach 100,000 simultaneous MQTTS connections with a rate of ~3,333 RPS (for both publish and receive), i.e. a message each 30 seconds for each connected client.
pt_br: Agora que você sabe como rodar testes distribuídos utilizando o Locust, você consegue executar o teste com 100.000 clientes. Para tal, você precisará de bastante poder computacional e múltiplas máquinas, tanto para a dojot como para o Locust, O objectivo é chegar a 100.000 conexões MQTTS simultâneas com taxa de ~3.333 RPS (tanto para publicação quanto para recepção), i.e. uma mensagem a cada 30 segundos para cada cliente conectado.

source: Since this is only a special case of the distributed test, we will only cover the specifications and some tips for the test, since the procedure to configure it is the same as we've already done.
pt_br: Como este é somente um caso especial de teste distribuído, cobriremos somente as especificações e algumas dicas para o teste, já que o procedimento para configuração é o mesmo que nós já fizemos.

source: As you might already know, this test is only possible in the Kubernetes installation of dojot.
pt_br: Como você já deve saber, este teste só é possível na instalação via Kubernetes da dojot.

source: Hardware specifications
pt_br: Especificações de hardware

source: For dojot platform:
pt_br: Para a plataforma dojot:

source: Machine name
pt_br: Nome da máquina

source: Hosted services
pt_br: Serviços presentes

source: VerneMQ, K2V and V2K
pt_br: VerneMQ, K2V e V2K

source: Kafka and Zookeeper
pt_br: Kafka e Zookeeper

source: The rest of the services
pt_br: O restante dos serviços

source: For Locust, we will use 5 replicas of the same machine, with **14GB** of RAM and **9** CPUs.
pt_br: Para o Locust, usaremos 5 réplicas da mesma máquina, com **14GB** de RAM e **9** CPUs.

source: General tips for the test
pt_br: Dicas gerais para o teste

source: Ansible has the ``100k`` tag to prepare the environment for a 100,000 clients test. It runs a minified version of dojot without some services. This was made because not all services are ready yet to support such a load.
pt_br: O Ansible tem a tag ``100k`` para preparar o ambiente para um teste com 100.000 clientes. Isto roda uma versão minificada da dojot, excluindo alguns serviços; tal estratégia foi adotada pois nem todos os serviços da dojot suportam tamanha carga.

source: By sharing a persistent volume between EJBCA pods, you can scale them up to increase the certificate creation throughput.
pt_br: Ao compartilhar um volume persistente entre *pods* da EJBCA, é possível escalá-la para aumentar a velocidade de criação de certificados.

source: The certificate creation can be distributed between all the Locust machines. In our example - with 5 Locust machines - we can generate 20,000 certificates in each machine. This can greatly increase the certificate throughput if EJBCA has been scaled too.
pt_br: A criação de certificados pode ser distribuída entre todas as máquinas de Locust. Em nosso exemplo - com 5 máquinas para o Locust - nós conseguimos gerar 20.000 certificados em cada máquina. Isso aumenta substancialmente a velocidade de criação de certificados quando aliado ao aumento de instâncias da EJBCA rodando.

source: After generating the certificates, make sure that all machines have all the certificates. You can export them by running ``generate_certs redis --export`` inside ``generate_certs`` container.
pt_br: Após gerar os certificados, confirme que todas as máquinas estão com todos os certificados. Você pode os exportar rodando o comando ``generate_certs redis --export`` dentro do contêiner do ``generate_certs``.

source: To check the number of certificates, run:
pt_br: Para verificar o número de certificados, rode:

source: The returned value should be ``200,003``. This number includes a key and a certificate for each device, the CA certificate and the ``renew`` and ``revoke`` directories.
pt_br: O valor retornado deve ser ``200.003``. Este número inclui a chave e o certificado de cada dispositivo, o certificado da CA e as pastas ``renew`` e ``revoke``.

source: It is strongly recommended to run one slave per CPU core, totalizing 45 slaves in this example.
pt_br: É altamente recomendado rodar um *slave* por núcleo, totalizando 45 *slaves* neste exemplo.

source: Since the Locust web interface does not persist any data, use Grafana's Locust dashboard to keep track of your test. Check the previous section for more info on how to configure the Locust exporter.
pt_br: Como a interface web do Locust não persiste nenhum dado, use o dashboard do Locust no Grafana para monitorar o seu teste. Verifique a seção anterior para mais informações sobre como configurar o Locust Exporter.

source: You can also run the test with ``revoke`` and ``renew``. Check the repository's README for more configurations' details.
pt_br: Você também pode rodar o teste com ``revoke`` e ``renew``. Verifique o README do repositório para mais detalhes de configuração.
