Repository: dojot/docs
Catalog: source/locale/*/LC_MESSAGES/mqtt-tls.po
Languages: pt_br

source: Using MQTT with security (TLS)
pt_br: Usando MQTT com segurança (TLS)

source: Audience: users
pt_br: Público: usuários

source: Level: intermediate
pt_br: Nível: intermediário

source: Reading time: 15 m
pt_br: Tempo de leitura: 15 m

source: This document describes how to configure the dojot and publish/subscribe using MQTT over TLS (MQTTS) when using the microservice Broker MQTT `IotAgent-VerneMQ`_ or Legacy Broker MQTT `IotAgent-Mosca`_.
pt_br: Este documento descreve como configurar a dojot e publicar/subscrever usando MQTT com TLS (MQTTS) ao usar o microsserviço *Broker MQTT* `IotAgent-VerneMQ`_ ou *Broker MQTT* legado `IotAgent-Mosca`_.

source: Table of Contents
pt_br: Índice

source: Components
pt_br: Componentes

source: The purpose of this component is to provide x.509 identification for final dojot entities, that is, IoT devices that communicate with the dojot IoT platform. See more about in `X.509 Identity Management`_.
pt_br: O objetivo deste componente é fornecer identificação x.509 para entidades dojot finais, ou seja, dispositivos IoT que se comunicam com a plataforma de IoT dojot. Veja mais sobre em `X.509 Identity Management`_.

source: What is a certificate?
pt_br: O que é um certificado?

source: A certificate contains the public key for an entity (a user, device, website), along with information about this entity, about the CA which signs the certificate, the allowed certificate usage and a checksum. When a entity wants a certificate to be signed, the entity should create a CSR file and send it to the desired CA. The CSR file is an 'intention of certification'. The file contains the information required from the entity and some information about the certificate use, hostnames and IPs where the certificate will reside, alternative names for the entity, etc.
pt_br: Um certificado contém a chave pública de uma entidade (um usuário, dispositivo, website), juntamente com informações sobre essa entidade, sobre a CA que assina o certificado, o uso permitido do certificado e uma soma de verificação. Quando uma entidade deseja que um certificado seja assinado, a entidade deve criar um arquivo CSR e enviá-lo para a CA desejada. O arquivo CSR é uma 'intenção de certificação'. O arquivo contém as informações necessárias da entidade e algumas informações sobre o uso do certificado, nomes de host e IPs onde o certificado residirá, nomes alternativos para a entidade etc.

source: IotAgent VerneMQ (Default)
pt_br: *IotAgent VerneMQ* (Padrão)

source: The IotAgent VerneMQ extends `VerneMQ`_ with some features and services for dojot case, see more in `IotAgent-VerneMQ`_. This is the **default** Broker MQTT in dojot deployments.
pt_br: O *IotAgent VerneMQ* estende o `VerneMQ`_ com alguns recursos e serviços para o caso da dojot, veja mais em `IotAgent-VerneMQ`_. Este é o *Broker MQTT* **padrão** em *deployments* dojot.

source: IotAgent Mosca (Legacy)
pt_br: *IotAgent Mosca* (Legado)

source: The IotAgent Mosca uses `Mosca`_ that is a node.js mqtt broker, see more about this service in `IotAgent-Mosca`_. This is the **not default** Broker MQTT in dojot deployments.
pt_br: O *IotAgent Mosca* usa o `Mosca`_ que é um *broker* mqtt em node.js , veja mais sobre este serviço em `IotAgent-Mosca`_. Este **não é** o *Broker MQTT* **padrão** em *deployments* dojot.

source: About using IotAgent VerneMQ or IotAgent Mosca
pt_br: Sobre o uso do *IotAgent VerneMQ* ou *IotAgent Mosca*

source: You shouldn't use the two brokers together to avoid port conflicts. Use either VerneMQ (default) or Mosca (legacy). By default, our deployments are using VerneMQ.
pt_br: Você não deve usar os dois *brokers* juntos para evitar conflitos de porta. Use VerneMQ (padrão) ou Mosca (legado). Por padrão, nossas *deployments* estão usando VerneMQ.

source: **It is necessary to configure the domain in which the broker will be accessible:**
pt_br: **É necessário configurar o domínio no qual o *broker* estará acessível: **

source: For the Ansible deployment:
pt_br: Para a implantação do Ansible:

source: It is necessary to configure the variable ``dojot_domain_name`` before starting with the domain or the ip that will be used to communicate with MQTT via TLS.
pt_br: É necessário configurar a variável ``dojot_domain_name`` antes de iniciar com o domínio ou o ip que será usado para se comunicar com o MQTT via TLS.

source: For the Docker-compose deployment:
pt_br: Para a implantação Docker-compose:

source: It is necessary to configure the variable ``DOJOT_DOMAIN_NAME`` in the `.env` file. before starting with the domain or the ip that will be used to communicate with MQTT via TLS.
pt_br: É necessário configurar a variável ` DOJOT_DOMAIN_NAME`` no arquivo `.env`. antes de começar iniciar com o domínio ou o ip que será usado para se comunicar com o MQTT via TLS.

source: In addition, you can choose between `IotAgent VerneMQ` or `IotAgent Mosca` when configuring the Ansible deployment (i.e. Kubernetes). In Docker-compose, you need to uncomment and comment the services in the ``docker-compose.yml``, there's a commented explanation about that in this file.
pt_br: Além disso, você pode escolher entre `IotAgent VerneMQ` ou` IotAgent Mosca` ao configurar o *deployment via Ansible* (ou seja, Kubernetes). No docker-compose, você precisa descomentar e comentar os serviços no arquivo ``docker-compose.yml``, há uma explicação comentada sobre isso neste arquivo.

source: Check the :doc:`./installation-guide` for more info.
pt_br: Verifique o :doc:`./installation-guide` para mais informações.

source: All the certificates will be automatically created, so there is no need to manually configure the brokers' ones.
pt_br: Todos os certificados serão criados automaticamente, não sendo necessário configurar manualmente os certificados nos *Brokers*.

source: How to connect a device with the IotAgent VerneMQ or IotAgent Mosca with mutual TLS
pt_br: Como conectar um dispositivo com o *IotAgent VerneMQ* ou *IotAgent Mosca* com TLS mútuo

source: First of all, you will need a running dojot's environment. Then you should create a new device (or use an existing one if you prefer) and retrieve its ID.
pt_br: Em primeiro lugar, você precisará de um ambiente da dojot em execução. Depois, será necessário criar o dispositivo na dojot (or usar um que já existe) e obter seu ID.

source: Retrieving certificate for a device
pt_br: Recuperando certificado para um dispositivo

source: For a device to connect using MQTT over TLS (MQTTS), it must possess:
pt_br: Para um dispositivo se conectar usando MQTT sobre TLS (MQTTS), ele deve possuir:

source: A key pair (.key file);
pt_br: Um par de chaves (arquivo .key);

source: A certificate signed by a Certificate Authority (CA) trusted by dojot (.crt file);
pt_br: Um certificado assinado por uma Autoridade de Certificação (CA) confiável pela dojot (arquivo .crt);

source: The certificate of this CA (.crt file);
pt_br: O certificado desta CA (arquivo .crt);

source: The objective when retrieving the certificate for a device is to obtain these three files: the device's certificate, the device's key pair and the CA certificate.
pt_br: O objetivo ao recuperar o certificado para um dispositivo é obter estes três arquivos: o certificado do dispositivo, o par de chaves do dispositivo e o certificado da *CA*.

source: There are two tools to facilitate obtaining certificates from the dojot platform:
pt_br: Existem duas ferramentas para facilitar a obtenção de certificados na plataforma dojot:

source: The `CertReq`_ script.
pt_br: O *script* `CertReq`_ .

source: GUI's embedded certificate generation utility (more details in :ref:`Generating certificates for devices`).
pt_br: Utilitário de geração de certificado embutido da GUI (mais detalhes em :ref:`Generating certificates for devices`).

source: In addition, you can use `OpenSSL`_ to create certificates and sign using the `API - x509-identity-mgmt`_, see more at `X.509 Identity Management`_.
pt_br: Além disso, você pode usar o `OpenSSL`_ para criar certificados e assinar usando a `API - x509-identity-mgmt`_, veja mais em `X.509 Identity Management`_.

source: A brief explanation of how to use `CertReq`_
pt_br: Uma breve explicação de como usar `CertReq`_

source: As prerequisites this uses `git`_, `OpenSSL`_, `curl`_ and `jq`_ .
pt_br: Como pré-requisitos, ele usa `git`_, `OpenSSL`_, `curl`_ e `jq`_.

source: On Debian-based Linux distributions, you can install these prerequisites by running:
pt_br: Em distribuições Linux baseadas em Debian, você pode instalar esses pré-requisitos executando:

source: Download `CertReq`_ on your machine directly from dojot repository and switch to the corresponding version of your dojot environment:
pt_br: Baixe `CertReq`_ em sua máquina diretamente do repositório dojot e mude para a versão correspondente do seu ambiente dojot:

source: Enter in ``certreq`` directory:
pt_br: Entre no diretório ``certreq``:

source: Finally, you can run the script to generate certificates and keys as follows:
pt_br: Finalmente, você pode executar o script para gerar certificados e chaves da seguinte maneira:

source: Given a *username* ``admin`` and *password* ``admin``, this command will request a certificate with *device ID (identifier)* ``a1998e`` for the dojot platform *host* ``localhost`` on *port* ``8000``.
pt_br: Dado um *nome de usuário* ``admin`` e uma *senha* ``admin``, este comando irá solicitar um certificado com *ID do dispositivo (identificador)* ``a1998e`` para a plataforma dojot no *host* ``localhost`` na *porta* ``8000``.

source: For more details about the CertReq parameters, check the `CertReq - Parameters`_ document. Other useful resources for this matter are the `How to connect a device with the IoTAgent-VerneMQ with mutual TLS`_ tutorial and the `CertReq`_ documentation.
pt_br: Para mais detalhes sobre os parâmetros do CertReq, verifique o documento `CertReq - Parameters`_. Outros recursos úteis para este assunto são o tutorial `How to connect a device with the IoTAgent-VerneMQ with mutual TLS`_ e a documentação do `CertReq`_.

source: And in the end this tool will create the directories ``./ca`` and ``./cert_{DEVICE_ID}`` to store the certificates and public/private keys.
pt_br: E no final esta ferramenta irá criar os diretórios ``./ca`` e ``./cert_{DISPOSTIVO_ID}`` para armazenar os certificados e chaves públicas/privadas.

source: Simulating a device with mosquitto
pt_br: Simulando um dispositivo com mosquitto

source: We are going to use `mosquitto` to simulate a device; it will publish and subscribe in dojot via MQTT.
pt_br: Vamos usar `mosquitto` para simular um dispositivo; ele publicará e subscreverá na dojot via MQTT.

source: Before continuing, install `mosquitto_pub` and `mosquitto_sub` from the `mosquitto-clients` package on Debian-based Linux distributions:
pt_br: Antes de continuar, instale o `mosquitto_pub` e `mosquitto_sub` do pacote `mosquitto-clients` em distribuições Linux baseadas no Debian:

source: Some Linux distributions, Debian-based Linux distributions in particular, have two packages for `mosquitto`_, one containing tools to access it (i.e. mosquitto_pub and mosquitto_sub for publishing messages and subscribing to topics) and another one containing the MQTT broker too. In this tutorial, only the tools from package `mosquitto-clients` on Debian-based Linux distributions are going to be used. Please check if another MQTT broker is not running before starting dojot (by running commands like ``ps aux | grep mosquitto``) to avoid port conflicts.
pt_br: Algumas distribuições Linux, distribuições Linux baseadas em Debian em particular, tem dois pacotes para `mosquitto`_ um contendo ferramentas para cliente (ou seja, `mosquitto_pub` e `mosquitto_sub` para publicar mensagens e se subscrever a tópicos) e outro contendo o *Broker* MQTT também. Neste tutorial, apenas as ferramentas do pacote `mosquitto-clients` serão utilizadas. Verifique se um outro *Broker* MQTT não está em execução antes de iniciar a dojot (executando comandos como ``ps aux | grep mosquitto``) para evitar conflitos de porta.

source: On Debian-based Linux distributions you can install ``mosquitto-clients`` running:
pt_br: Em distribuições Linux baseadas em Debian, você pode instalar ``mosquitto-clients`` executando:

source: To publish and subscribe using the appropriate certificates, you must have IotAgent VerneMQ Broker, V2K Bridge, K2V Bridge and the X.509 Identity Management running, see more in `IotAgent-VerneMQ`_.
pt_br: Para publicar e subscrever usando os certificados apropriados, você deve ter *IotAgent VerneMQ Broker*, *V2K Bridge*, *K2V Bridge* e o *X.509 Identity Management* em execução, veja mais em `IotAgent-VerneMQ`_.

source: Simulating a device publishing with mosquitto
pt_br: Simulando uma publicação de dispositivo com mosquitto

source: An example of publication with the certificates and keys generated in the previous topic with `CertReq`_ tool.
pt_br: Um exemplo de publicação com os certificados e chaves gerados no tópico anterior com a ferramenta `CertReq`_.

source: Simulating a device subscribing with mosquitto
pt_br: Simulando um dispositivo subscrevendo com mosquitto

source: For more details about simulate a device see in `Simulating a device with mosquitto`_ and more about simulate a device with security in `Simulating a device with mosquitto with security`_.
pt_br: Para obter mais detalhes sobre como simular um dispositivo, consulte `Simulating a device with mosquitto`_ e mais sobre simular um dispositivo com segurança em `Simulating a device with mosquitto with security`_.

source: To publish and subscribe using the appropriated certificates, you must need to be with the IotAgent Mosca Broker and the X.509 Identity Management running, see more in `IotAgent-Mosca`_. In addition, you need to use a **different topic** from VerneMQ and pass the identifier to publish and subscribe, as follows:
pt_br: Para publicar e subscrever usando os certificados apropriados, você deve estar com o *IotAgent Mosca Broker* e o *X.509 Identity Management* em execução, veja mais em `IotAgent-Mosca`_. Além disso, você precisa usar um **tópico diferente** do VerneMQ e passar o identificador para publicar e subscrever, da seguinte maneira:

source: How to publish:
pt_br: Como publicar:

source: How to subscribe:
pt_br: Como se subscrever:

source: In these examples, the published message has the attribute `attrs_example`. You need to change its name to comply to your device's attribute.
pt_br: Nestes exemplos, a mensagem publicada possui o atributo `attrs_example`. Você precisa alterar para os atributos do seu dispositivo.

source: Unsecured mode MQTT (without TLS)
pt_br: Modo inseguro do MQTT (sem TLS)

source: MQTT without security is not recommended, use this for testing only.
pt_br: MQTT sem segurança não é recomendado, use-o apenas para teste.

source: In *ansible-dojot* (kubernetes deployment) you can disable the *unsecured mode* by changing the ``dojot_insecure_mqtt`` variable to ``false``, this is valid in both Brokers. Check the :doc:`./installation-guide` for more info.
pt_br: Em *deployment via Ansible* (kubernetes), você pode desabilitar o modo não seguro alterando a variável ``dojot_insecure_mqtt`` para` `false``, isso é válido em ambos os *brokers*. Verifique :doc:`./installation-guide` para mais informações.

source: You can disable the *unsecured mode* if you make port 1883 unavailable for external access.
pt_br: Você pode desabilitar o *modo inseguro* se você tornar a porta 1883 indisponível para acesso externo.

source: For more details about simulating a device without security, check the `Simulating a device with mosquitto without security`_ tutorial.
pt_br: Para obter mais detalhes sobre como simular um dispositivo sem segurança, verifique o tutorial `Simulating a device with mosquitto without security`_ .

source: You can disable the *unsecured mode* in Mosca by changing the `ALLOW_UNSECURED_MODE` environment variable to ``'false'`` or by removing external access to the port `1883`. See more in `IotAgent-Mosca`_.
pt_br: Você pode desabilitar o *modo inseguro* no Mosca mudando a variável de ambiente `ALLOW_UNSECURED_MODE` para ``'false'`` ou removendo o acesso externo à porta `1883`. Veja mais em `IotAgent-Mosca`_.

source: How to read a certificate
pt_br: Como ler um certificado

source: A certificate file can be in two formats: PEM (base64 text) or DER (binary). `OpenSSL`_ offers tools to read such formats:
pt_br: Um arquivo de certificado pode estar em dois formatos: PEM (texto base64) ou DER (binário). `OpenSSL`_ oferece ferramentas para ler esses formatos:

source: Reading certificate:
pt_br: Como ler um certificado:

source: Getting certificate fingerprint:
pt_br: Obtendo a `fingerprint` do certificado:
