Repository: dojot/docs
Catalog: source/locale/*/LC_MESSAGES/ops_guide.po
Languages: pt_br

source: Operations Guide
pt_br: Guia de Operações

source: This document provides information on how to properly deploy and manage an instance of dojot. For documentation regarding the usage of the platform from the perspective of either an application, or device developer please refer to the [user guide]().
pt_br: Este documento prove informação sobre a forma correta de implantar e gerenciar uma instância da plataforma dojot. Para documentação sobre o uso da plataforma sobre a perspectiva de uma aplicação ou de um desenvolvedor de dispositivos, por favor consulte o [Guia de Usuários]().

source: Deployment
pt_br: Implantação

source: **TODO:** This section should describe the steps required to deploy the solution on all "homologated" environments (e.g. standalone, aws, google cloud, bluemix, etc.). For each environment, there'll also be a link pointing to the environment-specific section of the :ref:`resourceManagement` sub-section that describes how cloud resources are managed (allocated, released and pertinent configuration).
pt_br: **TODO:** Esta sessão deve descrever os passos necessários para implantar a solução em todos os ambientes "homologados" (e.g. standalone, AWS, Google Cloud, Bluemix, etc.). Para cada ambiente, há também um link apontando para a sessão de :ref:`resourceManagement` específica daquele ambiente, que descreve como recursos de nuvem são genrenciados (alocados, liberados e configurações pertinentes).

source: Device Management
pt_br: Gerenciamento de Dispositivos

source: **TODO:** This section should describe the steps required to configure a new device on the platform. While this information will also be presented on the user guide, here the idea is to give more focus to the specific infrastructure that has to be managed in order to guarantee the device's authenticity and communication.
pt_br: **TODO:** Está sessão deve descrever os passos necessários para configurar um novo dispositivo na plataforma. Enquanto esta informação também deve ser apresentada no guia de usuários, a idéia aqui é de dar mais atenção as especificidades da infraestrutura que será gerenciada para garantir a conectividade e autenticidade do dispositivo

source: User Management
pt_br: Gerenciamento de Usuários

source: **TODO:** This section should describe the steps required to configure user roles and role permissions for the platform itself, as well as handle application authentication features.
pt_br: **TODO:** Esta sessão deve descrever os passos necessários para configurar papéis e suas permissões para usuários da plataforma, bem como gerenciar a autenticação das próprias aplicações.

source: Resources Management
pt_br: Gerenciamento de Recursos

source: **TODO:** For each "homologated" deployment scenario, this section should describe how the deployment is done, as well as which parameters are available for each of them.
pt_br: **TODO:** Para cada ambiente de implantação "homologado", esta sessão deve descrever como a implantação é feita, bem como os parâmetros disponíveis para cada um deles.

source: System Dashboard
pt_br: Interface de Controle do Sistema

source: **TODO:** This should be a brief description of the system dashboard that is made available for the system administrator to check the system's overall status and alerts.
pt_br: **TODO:** Esta deve ser uma breve descrição da interface de controle do sistema que é disponibilizada para o administrador do sistema para verificar o estado geral do ambiente e seus alertas.
