Repository: dojot/docs
Catalog: source/locale/*/LC_MESSAGES/releases.po
Languages: pt_br

source: Release history
pt_br: Histórico de lançamento

source: Services
pt_br: Serviços

source: New Services
pt_br: Novos serviços

source: New tool using the Locust framework (https://locust.io/) for load testing in the dojot with the MQTT protocol
pt_br: Nova ferramenta utilizando o framework Locust (https://locust.io/) para testes de carga na dojot com o protocolo MQTT

source: New scalable MQTT IotAgent using the VerneMQ broker (https://vernemq.com/) and auxiliary integration services (V2K and K2V)
pt_br: Novo IotAgent MQTT escalável utilizando o broker VerneMQ (https://vernemq.com/) e serviços auxiliares de integração (V2K e K2V)

source: New graphical interface service, still under development, providing:
pt_br: Novo serviço de interface gráfica, ainda em desenvolvimento, disponibilizando:

source: Tool for creating a customizable dashboard with:
pt_br: Ferramenta para criação de dashboard customizável com:

source: Graphics of various formats
pt_br: Gráficos de diversos formatos

source: Tables
pt_br: Tabelas

source: New Kafka “real time” data consumption service via websocket with filters and partial data return
pt_br: Novo serviço para consumo de dados em “tempo real” do Kafka via websocket com filtros e retorno parcial de dados

source: New Kafka messaging service to an FTP server
pt_br: Novo serviço de envio de mensagens do Kafka para um servidor FTP

source: New dojot x509 certificate service using EJBCA (https://www.ejbca.org/)
pt_br: Novo serviço de certificados x509 da dojot utilizando a EJBCA (https://www.ejbca.org/)

source: Improvements and fixes
pt_br: Melhorias e correções

source: Documentation improvements
pt_br: Melhorias na documentação

source: Several code improvements
pt_br: Diversas melhorias de código

source: Removal of topic mapping from kafka by id via Redis, it is now possible to use the topic name directly
pt_br: Remoção do mapeamento de tópicos do kafka por id via Redis, agora é possível utilizar o nome do tópico diretamente

source: Performance improvements in code
pt_br: Melhorias de performance no código

source: Various code performance improvements including better parallelization of processing queues
pt_br: Diversas melhorias de performance no código incluindo uma melhor paralelização das filas de processamento

source: Minor bug fixes
pt_br: Correção de pequenos bugs

source: Support for Kubernetes 17 with remote nodes
pt_br: Suporte ao Kubernetes 17 com nós remotos

source: New “Publish FTP” node
pt_br: Novo nó “Publish FTP”

source: Added CRL support
pt_br: Adicionado suporte a CRL

source: Added control of maximum active and inactivity connection time
pt_br: Adicionado controle de tempo de conexão máxima ativa e por inatividade

source: Integration with the new X.509 Identity Management service
pt_br: Integração com o novo serviço X.509 Identity Management

source: Added historical reporting option by device
pt_br: Adicionada opção de relatório de histórico por dispositivo

source: Added x509 certificate generation option for a device
pt_br: Adicionada opção de geração de certificados x509 para um dispositivo

source: Base url route customization
pt_br: Customização de rota da url base

source: New “First N” filter option that returns the first N data that is currently persisted
pt_br: Nova opção de filtro “First N” que retorna os N primeiros dados que estão persistidos atualmente

source: Improvements to data indexing in MongoDB
pt_br: Melhorias na indexação dos dados no MongoDB

source: Migration to Kong Gateway version 2 (https://konghq.com/kong/)
pt_br: Migração para a versão 2 do Kong Gateway (https://konghq.com/kong/)

source: Deployments
pt_br: Implantações

source: Upgrade to docker-compose version 3.8
pt_br: Atualização para a versão 3.8 do docker-compose

source: Update version of external services
pt_br: Atualização de versão de serviços externos

source: Added new services
pt_br: Adicionado novos serviços

source: Several improvements mainly aimed at scalability and simplification of the installation process
pt_br: Diversas melhorias principalmente visando escalabilidade e simplificação do processo de instalação

source: Update to version 17 of kubernetes
pt_br: Atualização para a versão 17 de kubernetes

source: Added Load Balancer - Nginx
pt_br: Adicionado Load Balancer - Nginx

source: Added Prometheus and Grafana to monitor part of the infrastructure (VMs, VerneMQ, Kubernetes, etc.)
pt_br: Adicionado Prometheus e Grafana para monitorar parte da infraestrutura (VMs, VerneMQ, Kubernetes, etc)

source: Libraries
pt_br: Bibliotecas

source: New dojot library in node.js with:
pt_br: Nova biblioteca dojot em node.js com:

source: Kafka Handlers - Module responsible for Consumer (can use regular expressions in topics) and Producer
pt_br: Kafka Handlers - Módulo responsável pelo Consumer (podendo utilizar expressões regulares nos tópicos) e Producer

source: Config Manager - Module responsible for creating the standardized configuration file for the services
pt_br: Config Manager - Módulo responsável pela criação do arquivo de configuração padronizada para o serviços

source: Service State Manager - Module to define graceful shutdown and health check for the service
pt_br: Service State Manager - Módulo para definir graceful shutdown e health check para o serviço

source: WebUtils - Module for creating a server and a web structure (Express.js) to handle HTTP (S) requests.
pt_br: WebUtils - Módulo para a criação de um servidor e uma estrutura web (Express.js) para lidar com solicitações HTTP(S).

source: Logger - Log module to be used in services in a standardized way
pt_br: Logger - Módulo de log para ser utilizado nos serviços de forma padronizada
