Repository: dojot/docs
Catalog: source/locale/*/LC_MESSAGES/security.po
Languages: pt_br

source: Crypto Service
pt_br: Serviço Crypto

source: Crypto Service provides data encryption and decryption functions to other *dojot* components. It is used only by internal services so they can protect data communication (both internally and externally) and data storage.
pt_br: O serviço Crypto provê funções criptográficas de cifra e decifra de dados para os demais componentes da plataforma dojot. Ele é usado somente pelos serviços internos e, Ccom isso, os componenteseles internos podem proteger os dados que serão trafegados internamente/externamente ou os dados que serão armazenados, por exemplo.

source: Available as a Docker image, Crypto Service can be instantiated easily and integrated in a short time. Encrypt and decrypt data functionalities are accessed through REST APIs.
pt_br: Disponível como imagem Docker, o serviço Crypto pode ser instanciado com facilidade e incorporado em pouco tempo. As funcionalidades para cifra/decifra de dados são disponibilizadas através de interface REST.

source: REST APIs
pt_br: Interface REST

source: Encrypt and decrypt data APIs are described below.
pt_br: As APIs para cifrar decifrar dados são descritas abaixo

source: Usage Examples
pt_br: Exemplos de Uso

source: In order to use cryptographic functions provided by Crypto Service, one must access the available REST APIs through a HTTP request.
pt_br: Para utilizar as funções criptográficas que o Crypto oferece, é necessário acessar as interfaces REST através de uma chamada HTTP.

source: Examples of how those requests can be made are showed bellow using the command line tool curl.
pt_br: Abaixo são apresentados exemplos de como essas chamadas podem ser feitas usando a ferramenta de linha de comando curl.

source: Mutual Authentication
pt_br: Autenticação Mútua

source: A security role is to ensure that only legitimate users have access to the resources and information they need to perform their duties. Authentication is part of this access control, when validating entities identity. At the same time, another security role is to ensure that an entity accesses legitimate resources and information, thereby avoiding situations such as sending information to fraudulent servers, for example.
pt_br: Um papel da segurança é de garantir que somente usuários legítimos tenham o acesso aos recursos e informações necessárias para realizar suas funções. A autenticação faz parte deste controle de acessos, ao validar a identidade de entidades. Ao mesmo tempo, outro papel da segurança é garantir que uma entidade acesse os recursos e informações legítimas, evitando assim situações como o envio de informações a servidores fraudulentos, por exemplo.

source: Mutual authentication is the process in which two entities authenticate each other. In a client-server communication, the client must prove its identity to the server and the server must prove its identity to the client. Thus, each entity can ensure that they are communicating with a legitimate interlocutor.
pt_br: Autenticação Mútua é o processo no qual duas entidades fazem a autenticação uma da outra. Numa comunicação cliente-servidor, o cliente deve provar sua identidade ao servidor e o servidor deve provar sua identidade ao cliente. Dessa forma, cada entidade pode garantir que está se comunicando com um interlocutor legítimo.

source: Mutual authentication protects access to data the application accesses from *dojot* and therefore protects access to data of that application’s user. It is done by ensuring that only registered applications can access platform data and functionality. In addition, it ensures that the platform the application is accessing is legitimate, meaning that no attacker can pass themselves by the platform and get user or application data.
pt_br: A autenticação mútua protege o acesso aos dados que a aplicação acessa na *dojot* e, por consequência, protege o acesso ao dados dos usuários dessa aplicação. Ela faz isso garantindo que somente as próprias aplicações registradas possam acessar os dados e funcionalidades da plataforma. Adicionalmente, ela assegura que a plataforma que a aplicação esteja acessando é legítima, ou seja, que nenhum atacante possa se passar pela plataforma e obter dados da aplicação e de seus usuários.

source: *Dojot* offers a mutual authentication service through a Docker image. This service runs inside the platform and can be accessed using its interfaces.
pt_br: A *dojot* oferece um serviço de autenticação mútua através de uma imagem Docker. Esse serviço é executado na plataforma e pode ser acessado usando as interfaces adequadas.

source: Using Mutual Authentication
pt_br: Usando a Autenticação Mútua

source: Applications can access *dojot* functionality to interact with its components and connected devices. For an application to ensure that it is communicating with a legitimate platform (and vice versa), it must make use of the mutual authentication functionality *dojot* provides. This is a simple process and its use requires only three steps to follow:
pt_br: Aplicações podem acessar as funcionalidades da *dojot* para interagir com seus componentes e com os dispositivos conectados. Para que uma aplicação possa garantir que está se comunicando com uma plataforma legítima (e vice-versa), ela deve fazer o uso da funcionalidade de autenticação mútua que a *dojot* fornece. Esse é um processo simples e seu uso requer apenas 3 passos a serem seguidos:

source: Application Registration. When an application is registered in *dojot*, it receives an identifier and a key that must be kept secret. This key is used to authenticate the application on the platform.
pt_br: Registro da aplicação. Quando uma aplicação é registrada na *dojot*, ela recebe um identificador e uma chave que deve ser mantida em segredo. Essa chave é usada para autenticar a aplicação na plataforma.

source: Authentication. At the beginning of the communication between application and *dojot*, the application initiates a handshake in which the two entities will exchange information to ensure they are legitimate.
pt_br: Autenticação. No início da comunicação entre a aplicação e a *dojot*, a aplicação inicia um processo de handshake no qual as duas entidades irão trocar informações de forma a garantir que são legítimas.

source: Using the platform. When accessing *dojot* interfaces, the platform informs a session identifier that is obtained at the time of authentication. Thus, the platform can verify that the mutual authentication process was performed by the application.
pt_br: Uso da plataforma. Ao acessar as interfaces da *dojot*, a plataforma informa o identificador da sessão que obteve no momento da autenticação. Com isso, a plataforma pode verificar que a aplicação realizou o processo de autenticação mútua

source: Application Registration
pt_br: Registro de aplicação

source: An application that is registered with *dojot* will receive an identifier and a key that must be kept secret. The registration indicates that an application will communicate and use platform features.
pt_br: Uma aplicação que se registra na *dojot* irá receber um identificador e uma chave que deve ser mantida em segredo. O registro indica que uma aplicação irá se comunicar e utilizar funcionalidades da plataforma.

source: Currently, the method used to register an application is the use of a REST interface. After making the request for the registration, the application will receive a unique identifier and a key. The API is described below
pt_br: Atualmente, o método utilizado para fazer o registro de uma aplicação é o uso de uma interface REST. Após fazer a requisição para o registro, a aplicação receberá um identificador único e uma chave. A API é descrita abaixo.

source: **REGISTER COMPONENT** - Register new application
pt_br: **REGISTER COMPONENT** - Registro de nova aplicação

source: Received identifier and key will be used at the moment the application authenticates with *dojot*. In order to do this, a client library is provided to perform the authentication process (available in github.com/dojot/ma-client-libs) and therefore, the library should have knowledge about the values of the identifier and the key. The file https://github.com/dojot/ma-client-libs/kerberos/src/protocol/unique.h is used to store these values and will be used by the library at the moment of authentication.
pt_br: O identificador e a chave recebidos serão usados no momento da autenticação com a *dojot*. Para isso, uma biblioteca cliente é fornecida para realizar o processo de autenticação (disponível em github.com/dojot/ma-client-libs) e, portanto, a biblioteca deverá ter conhecimento sobre os valores do identificador e chave. O arquivo https://github.com/dojot/ma-client-libs/kerberos/src/protocol/unique.h é utilizado para armazenar esses valores e será usado pela biblioteca no momento da autenticação.

source: Authentication
pt_br: Authenticação

source: When communicating with *dojot*, the application must perform mutual authentication. This process is done through the library provided in github.com/dojot/ma-client-libs. By using the library, three steps should be followed:
pt_br: Ao se comunicar com a *dojot*, a aplicação deve realizar a autenticação mútua. Esse processo é feito através da biblioteca fornecida em github.com/dojot/ma-client-libs. Ao utilizar a biblioteca, 3 passos devem ser seguidos:

source: Initialize the library with server addresses
pt_br: Inicializar a biblioteca com os endereços do servidor

source: Register the callback function
pt_br: Registrar a função de callback

source: Call mutual authentication function
pt_br: Chamar a função de autenticação mútua

source: Library Initialization
pt_br: Inicialização da Biblioteca

source: Initialization tells the library which URLs will be used to perform mutual authentication. The function to be used is described below:
pt_br: A inicialização informa à biblioteca as URLs que serão usadas ao realizar a autenticação mútua. A função a ser utilizada é descrita abaixo:

source: The arguments used in the function are described below.
pt_br: Os argumentos utilizados na função são descritos a seguir.

source: host - Platform main URL
pt_br: host - URL principal da plataforma

source: hostLength - Host string size
pt_br: hostLength - Tamanho da string de host

source: uriRequestAS - requestAS endpoint
pt_br: uriRequestAS - Endpoint de acesso de requestAS

source: requestASLength - requestAS string size
pt_br: requestASLength - Tamanho da string de requestAS

source: uriRequestAP - requestAP endpoint
pt_br: uriRequestAP - Endpoint de acesso de requestAP

source: requestAPLength - requestAP string Size
pt_br: requestAPLength - Tamanho da string de requestAP

source: The following code snippet shows an example of how the function can be used.
pt_br: O trecho de código a seguir mostra um exemplo de como a função pode ser utilizada.

source: Callback Registration
pt_br: Registro de Callback

source: On the mutual authentication process, the library communicates with the server and checks received data. If an error occurs during this process, the library will call a callback function.
pt_br: No processo de autenticação mútua, a biblioteca se comunica com o servidor e verifica os dados recebidos. Se algum erro ocorrer durante esse processo, a biblioteca vai chamar uma função de callback.

source: This callback function is implemented by the library user and must be registered before the authentication process. The callback function can include code for error handling and logging, for example.
pt_br: Essa função de callback é implementada pelo usuário da biblioteca e deve ser registrada antes do processo de autenticação. A função de callback pode conter código para tratamento de erro ou logs, por exemplo.

source: The following code shows an example of how the callback function can be created and registered.
pt_br: O código a seguir mostra um exemplo de como a função de callback pode ser criada e registrada.

source: After initializing the library with platform URL and registering the callback function, the library is ready to perform the mutual authentication process. The function that is used to perform the process is shown below.
pt_br: Depois de inicializar a biblioteca com os endereços da plataforma e registrar a função de callback, a biblioteca está pronta para realizar o processo de autenticação mútua. A função que é usada para realizar o processo é mostrada abaixo.

source: The code below shows an example of how the function may be used.
pt_br: O código abaixo mostra um exemplo de como a função pode ser usada

source: Accessing *dojot* APIs
pt_br: Acessando as API da plataforma *dojot*

source: After the mutual authentication process completes, the application may send additional data in the calls to the platform interfaces. This data is the mutual authentication session identifier and is sent through an HTTP header.
pt_br: Após o processo de autenticação mútua ser concluído, a aplicação poderá enviar um dado adicional nas chamadas às interfaces da plataforma. Esse dado é o identificador de sessão de autenticação mútua e é enviado por meio de um header HTTP.

source: The following is an example of a call to a *dojot* API where mutual authentication session identifier is also sent.
pt_br: A seguir é apresentado um exemplo de uma chamada para uma API da *dojot* onde o identificador de sessão da autenticação mútua também é enviado.
