Repository: dojot/docs
Catalog: source/locale/*/LC_MESSAGES/using-web-interface.po
Languages: pt_br

source: Using web interface
pt_br: Usando a interface WEB

source: This tutorial will show how to do basic operations in dojot, such as creating devices, checking its attributes and creating flows, import/export and firmware update.
pt_br: Este tutorial descreve as operações básicas na dojot, como criar dispositivos, conferir seus atributos e criar fluxos, importar/exportar e atualizar firmware.

source: Who is this for: entry-level users
pt_br: Para quem é esse tutorial: usuários iniciantes

source: Level: basic
pt_br: Nível: básico

source: Reading time: 20m
pt_br: Tempo de leitura: 20 minutos

source: Device management
pt_br: Gerenciamento de dispositivo

source: This section will show how to manage device. For this tutorial we will show how to add two thermometers and a virtual device that will represent an alarm system that will monitor both sensors.
pt_br: Esta seção mostra como gerenciar dispositivos. Para tal, serão utilizados dois dispositivos sensores de temperatura e um dispositivo virtual, esse último com a função de observar as temperaturas medidas nos dois primeiros e gerar alarmes em determinadas condições.

source: As described in :doc:`./concepts`, all devices are based on a template. To create one, you should access the template tab at the left and then create one new template, as shown below.
pt_br: Como descrito em :doc:`./concepts`, todos os dispositivos são baseados em um ou mais modelos (templates). Para a criação de um modelo, você deve acessar a opção Modelos (Templates) na lateral esquerda da tela e então criar um Novo Modelo (New Template), como mostrado abaixo.

source: To create new devices, you should go back to the devices tab and create a new device, selecting the templates it will be based on, as shown below.
pt_br: Para criar novos dispositivos, deve-se voltar para a opção Dispositivos (Devices) e criar um Novo Dispositivo (New Device), selecionando os modelos nos quais o dispositivo será baseado, como mostrado abaixo.

source: Note that, when you select the template in the right panel at device creation screen, all attributes are inherited from that device. You could add more templates as needed, keeping in mind that templates used to compose a device must not share an attribute with the same name.
pt_br: Note que, quando um modelo é selecionado no painel direito da tela de criação de dispositivo, todos os atributos são herdados para aquele dispositivo. É possível adicionar mais de um modelo, tendo em mente que modelos que compõem o dispositivo não podem compartilhar atributos com o mesmo nome.

source: As devices are tightly associated to templates, if you want to remove a template, you should remove all its associated devices first. If such thing happens the following error message will appear:
pt_br: Os dispositivos são fortemente atrelados aos a modelos. Para remover um modelo, deve-se remover primeiro todos os dispositivos a ele associados. Caso contrário, a seguinte mensagem aparecerá:

source: You can add and remove attributes from templates and they will be immediately available to devices. In case of new attributes being added, though, you should keep in mind that there must not be any device with templates which have attributes with same name. If such thing happens, the following message will appear:
pt_br: É possível adicionar e remover atributos dos modelos, fazendo com que as alterações sejam imediatamente refletidas nos dispositivos associados. No caso de novos adição, no entanto, deve-se observar que os atributos dos modelos que compõem um determinado dispositivo não podem possuir o mesmo nome. Se isso acontecer, a seguinte mensagem aparecerá:

source: This snapshot was generated by creating a new template (``ExtraTemplate``) with one attribute, called ``level``. Then a new device based on both templates was created and, afterwards a new attribute also called ``level`` was added to ``ThermTemplate``.
pt_br: Essa imagem da tela foi capturada quando um novo modelo foi criado (``ExtraTemplate``) com um atributo chamado ``level``. Depois um novo dispositivo baseado em ambos os modelos foi criado e um novo atributo também chamado ``level`` foi adicionado ao modelo ``ThermTemplate``.

source: When this happens, no modification is applied to the template (no attribute named "level" related to the "ThermTemplate" is created). However, it remains in the template card so the user can figure out what is happening. If the user refreshes the page, it will be reverted to what it was before the modification.
pt_br: Quando isso ocorre, nenhuma modificação é aplicada ao modelo (nenhum atributo com nome "level" relativo ao "ThermTemplate" é criado). Contudo, o atributo é mantido no cartão do modelo para que o usuário perceba o que está acontecendo. Se o usuário atualizar a tela, as informações serão revertidas para o estado que estava antes da modificação.

source: Now the physical devices can send messages to dojot. There are few things to pay attention to: the MQTT topic is ``<tenant>:<device-id>/attrs``.
pt_br: Agora os dispositivos físicos podem enviar mensagens para dojot. Há alguns pontos de atenção: o tópico MQTT deve estar no formato ``<tenant>:<device-id>/attrs``.

source: For simplicity's sake, we'll emulate one device using mosquitto_pub tool. We set the ``username`` parameter by using the ``-u`` flag of mosquitto_pub. See more about in :doc:`using-api-interface` at topic Sending Messages.
pt_br: Por questão de simplicidade, será emulado um dispositivo utilizando-se a ferramenta mosquito_pub. O parâmetro ``username`` será configurado utilizando a opção ``-u`` do mosquito_pub. Veja mais sobre em :doc:`using-api-interface` no tópico Enviandos Mensagens.

source: In the videos we are using Mosca as the MQTT broker, so the messages are being sent to topics in the old format. If you are using VerneMQ, change them according to the forementioned pattern. Check :doc:`faq/faq` for more info about the differences between them.
pt_br: Nos vídeos, nós estamos utilizando o Mosca como broker MQTT, então as mensagens estão sendo enviadas para tópicos no formato antigo. Se você está utilizando o VerneMQ, mude-os de acordo com o formato supracitado. Verifique a página de :doc:`faq/faq` para maiores informações.

source: The examples are using insecure MQTT. The recommended approach is to use TLS. Check the section :doc:`mqtt-tls`.
pt_br: Os exemplos estão utilizando MQTT sem segurança. A abordagem recomendada é utilizar TLS. Verifique a página :doc:`mqtt-tls`.

source: Now that we've created the sensors, let's create a virtual one. This will be the representation of a alarm system that will be triggered whenever something bad is detected to these sensors. Let's say they are installed in a kitchen. So it is expected that their temperature readings will be no more than 40C. If it is more than that, our simple detection system will conclude that the kitchen is on fire. This alarm representation will have two attributes: one for a severity level for a particular alarm and another one for a textual message, so that the user is properly informed of what's happening.
pt_br: Estando criados os sensores de temperatura, falta agora a criação do dispositivo virtual. Ele será a representação de um alarme de sistema disparado quando algo ruim for detectado pelos sensores. Por exemplo, se os sensores de temperatura estivessem instalados em uma cozinha, a medição de uma temperatura acima de 40ºC poderia indicar que o local estaria em chamas. Essa representação do alarme poderia ter dois atributos: nível de severidade e mensagem textual, para que o usuário pudesse ser informado do acontecimento.

source: Just as for "regular devices", virtual devices also are based on templates. So, let's create one, as shown below.
pt_br: Assim como "dispositivos regulares", dispositivos virtuais também são baseados em modelos. Portanto, um modelo será criado, como mostrado abaixo.

source: Flow configuration
pt_br: Configuração de fluxo

source: Once we've created the virtual device, we can add a flow to implement the logic behind the alarm generation. The idea is: if the temperature reading is less than 40, then the alarm system will be updated with a notification of severity 4 (mildly important) and a message indicating that the kitchen is OK. Otherwise, if the temperature is higher than 40, then a notification is sent with severity 1 (highest severity) and a message indicating that the kitchen is on fire. This is done as shown belown.
pt_br: Uma vez criado o dispositivo virtual, pode-se adicionar um fluxo para implementar a lógica por detrás da geração de alarmes. A ideia é: se a temperatura medida for menor ou igual a 40ºC, o sistema de alarmes será atualizado com uma notificação de severidade 4 (média) e uma mensagem indicando que a cozinha está OK. Caso a temperatura medida seja maior que os 40ºC, uma notificação de severidade 1 (muito alta) será enviada com a mensagem que a cozinha está em chamas. Isto é feito como mostrado abaixo.

source: Note that the "change" nodes have a reference to an "output" entity. This can be thought as a simple data structure - it will have a ``message`` and a ``severity`` attributes that match those from the virtual device. This "object" is referenced in the output node as a data source for the device to be updated (in this case, the virtual device we've created). In other words, you can think of this as a piece of information carried from "change" nodes to the "virtual device" with names "msg.output.message" and "msg.output.severity", where "message" and "severity" are the virtual device attributes.
pt_br: É importante notar que os nós do tipo "change" têm uma referência a uma entidade "output". Isso pode ser visto como uma simples estrutura de dados, onde existem os atributos ``message`` e ``severity`` que casam com aqueles do dispositivo virtual. Este "objeto" é referenciado no nó de saída (output) como uma fonte de dados para o dispositivo que será atualizado (nessa caso, o dispositivo virtual criado). Em outras palavras, pode-se dizer que há uma informação que é transferida dos nós do tipo "change" para o "dispositivo virtual" com os nomes "msg.output.message" e "msg.output.severity", onde "message" e "severity" são atributos do dispositivo virtual.

source: So, let's send a few more messages and see what will happen to that virtual device.
pt_br: Vamos, agora, enviar mais algumas mensagens e ver o que acontece para aquele dispositivo virtual.

source: Import and Export
pt_br: Importar e Exportar

source: This section shows how to use the Import and Export features. These options allow your configuration data to be saved to a file, for Export, and loaded to dojot, for Import. This file has the JSON format and it contains the data from templates, devices, flows, remote nodes, and scheduling tasks that were entered in your tenant. To perform data configuration export procedure, expand the menu at the top right of the page, click “Import / Export” and then “Export” as shown below:
pt_br: Essa seção mostra como usar as funcionalidades Importar e Exportar. Tais opções permitem que seus dados de configuração sejam salvos em um arquivo , no caso de uma exportação, e carregados na dojot, no caso de Importação. Esse arquivo possui o formato *JSON* e contém os dados de modelos, dispositivos, fluxos, nós remotos e tarefas de agendamento que foram cadastrados na sua organização.Para executar o procedimento de exportação dos dados de configurações, expanda o menu no canto superior direito da página, clique em \“Import/Export (Import./Exportação)\” e então, em \“Export (Exportar)\”, conforme ilustrado no vídeo a seguir:

source: The exported file can be stored as a backup and later imported back into Dojot.
pt_br: O arquivo exportado pode ser armazenado como backup e posteriormente importado novamente na Dojot.

source: To perform data configuration import procedure, expand the menu in the upper right corner of the page, click "Import / Export" and then "Import." In the window that appears it is possible to drag and drop your file or browse to the destination folder and select it. It is only allowed to add a JSON extension file, in the expected format, as illustrated in the following video:
pt_br: Para executar o procedimento de importação de uma configuração, expanda o menu no canto superior direito da página, clique em \“Import/Export (Import./Exportação)\” e então, em \“Import (Importar)\”. Na janela que aparece é possível arrastar e soltar seu arquivo ou navegar na pasta de destino e selecioná-lo, sendo só permitido adicionar um arquivo de extensão *JSON*, no formato esperado, conforme ilustrado no vídeo a seguir:

source: When performing the import procedure all current tenant configuration, such as: devices, templates, flows, remote nodes and scheduling tasks, will be permanently deleted, so that new ones are created. History data is not part of importing and exporting!
pt_br: Ao executar o procedimento de importação todas as configurações atuais da organização tais como: dispositivos, modelos, fluxos, nós remotos e tarefas de agendamento, serão excluídas permanentemente para que as novas sejam criadas. Os dados de histórico não fazem parte do importar e exportar!

source: Firmware update
pt_br: Atualização de Firmware

source: During the lifetime of a device, you may need to update control software (firmware) to correct some issues you encounter while using it, or even add new features. Dojot currently supports the firmware upgrade procedure via the LwM2M communication protocol. For details regarding the procedure for integrating with your device please check the LwM2M protocol specification. If your device communicates via this protocol and has the firmware update procedure in place, you can follow the steps below to update your device version.
pt_br: Durante a vida útil de um dispositivo, pode ser necessário atualizar seu software de controle (firmware) a fim de corrigir eventuais problemas encontrados durante seu uso ou até mesmo adicionar novas funcionalidades. Atualmente a dojot suporta o procedimento de atualização de firmware via o protocolo de comunicação LwM2M. Para saber detalhes a respeito do procedimento para integração com seu dispositivo por favor verifique a especificação do protocolo LwM2M. Caso seu dispositivo se comunica via este protocolo e possui o procedimento de atualização de firmware implementado, você pode seguir os passos a seguir para atualizar a versão do seu dispositivo.

source: The firmware upgrade process consists of three steps:
pt_br: O processo de atualização de firmware é composto por três etapas:

source: image management;
pt_br: gerenciamento das imagens

source: image transfer to device;
pt_br: transferência da imagem para o dispositivo;

source: image application on device;
pt_br: aplicação da imagem no dispositivo

source: The details of their implementation are as follows.
pt_br: O detalhamento da execução destas encontra-se a seguir.

source: In order to enable the firmware management you must create a template and, once saved, enable the firmware manager. After that, you can upload the firmware images to the Dojot repository that are associated with this template. Attention: the image extension must be ".hex".
pt_br: Para que a habilitação de gerenciamento de firmware seja disponibilizada, é preciso criar um modelo e, depois de salvo, habilitar o gerenciador de firmware. Após isso, é possível enviar as imagens de firmware para o repositório da dojot que são associadas a este modelo. Atenção: a extensão da imagem deve possuir a extensão ".hex".

source: Note that when Firmware Manager is enabled, five attributes are assigned to the template. They are used to support image updating. Attribute names can be edited as required by the application. The attributes are:
pt_br: Note que assim que o Gerenciador de Firmware é habilitado, são atribuídos ao modelo cinco atributos que são usados para suportar a atualização de imagens. Os nomes dos atributos podem ser editados conforme a necessidade da aplicação. Os atributos são:

source: Device State:
pt_br: Estado do dispositivo (Device State):

source: Current state of firmware update
pt_br: Estado atual da atualização de firmware

source: Result of apply version:
pt_br: Resultado da versão de aplicação (Result of apply version)

source: Contains the result of downloading or updating the firmware
pt_br: Resultado da última aplicação de atualização de uma imagem de firmware;

source: Sets which version to transfer:
pt_br: Define qual versão transferir (Sets which version to transfer):

source: Indicates to the IoT agent responsible for the device, what is the name and version of the firmware image to be downloaded and updated on the device
pt_br: Indica ao agente IoT, responsável pelo dispositivo, qual deve ser o nome e a versão da imagem de firmware a ser transferida e atualizada no dispositivo

source: Trigger version update:
pt_br: Acionar atualização da versão (Trigger version update)

source: Actuator used to initiate firmware update procedure
pt_br: Atuador utilizado para iniciar o procedimento de atualização de firmware

source: Current version of the image:
pt_br: Versão atual da imagem (Current version of the image):

source: Current version of the firmware image, provided by the device
pt_br: Versão atual da imagem de firmware, caso disponibilizado pelo mesmo

source: After you create the template with the Firmware management option enabled, you can associate it with a device. So, you can then transfer an image and apply it to the device, as shown in the video below:
pt_br: Após criar o modelo com a opção de gerenciamento de firmware habilitada, é preciso associá-lo a um dispositivo. Assim é possível transferir uma imagem e aplicá-la no dispositivo, conforme o vídeo abaixo:

source: Generating certificates for devices
pt_br: Gerando certificados para dispositivos

source: This section will show how to generate x509 certificates for a device, so that dojot can communicate with devices securely via TLS. To be able to send a publication, it is necessary to download the three files, the private key "admin 4302d4.key", the device certificate "admin 4302d4.crt" and the CA certificate "ca.crt".
pt_br: Nesta seção será demonstrado como gerar certificados x509 para um dispositivo, para que a dojot consiga se comunicar com os dispositivos de forma segura via TLS. Para conseguir realizar o envio de uma publicação é necessário o download dos três arquivos, sendo eles a chave privada "admin 4302d4.key", o certificado do dispositivo "admin 4302d4.crt" e o certificado da CA “ca.crt”.

source: The generation of certificates via the graphical interface (GUI) only works in deployments where it is possible to access the GUI via *HTTPS* or *localhost*.
pt_br: A geração de certificados via interface gráfica (GUI) só funciona em deployments em que é possível acessar a GUI via *HTTPS* ou *localhost*.

source: To be able to execute the command of the example video it is necessary to be in the same directory as the 3 files attached. Command used in the example:
pt_br: Para conseguir executar o comando do vídeo de exemplo é necessário estar no mesmo diretório que os 3 arquivos estão. Comando utilizado no exemplo:

source: Generating device history report
pt_br: Gerando relatório de histórico de dispositivos

source: This section will demonstrate how to generate a device history report. The report is able to show data for one or more attributes of the respective device. For this, it is necessary to select the desired attributes, define the period and click on “generate”.
pt_br: Nesta seção será demonstrado como gerar um relatório de histórico de um dispositivo. O relatório consegue mostrar os dados de um ou mais atributos do respectivo dispositivo. Para isso, é necessário selecionar os atributos desejados, definir o período e clicar em “gerar”.

source: Performing access to the Dashboard
pt_br: Realizando acesso ao Dashboard

source: The dashboard is part of gui-v2, to access it you need to use another url, in the current version just add to the end of the url “/v2” in relation to the interface used in the previous items, for example, in the case of localhost it would be http://localhost:8000/v2, see more at :doc:`components-and-apis`. The login and password credentials are the same as those used in the rest of Dojot. After logging in, a new screen will open and an ADD button will appear in the upper right corner, which will give you the options for various types of viewing. At this moment, the parameters will be configured, in the first “General” screen it will be necessary to add a name for the visualization and optionally a description. The list of devices will appear on the next screen, if you do not find the desired device, you can search by name. After selecting the device, the attributes that are linked to it will be listed, and a color can be chosen to display each attribute, it is also possible to add a caption for each attribute. In “retrieve records by:“ it will be possible to configure some filters, you can select the type of historical data filter as the “last records”, in “order” (minute, hours, days and months), and you can also choose an interval time, in addition you can still view the records in “Real time”, as new data is received they will be displayed in the chosen view. After everything is configured, a summary will be shown with the chosen name and attributes. When accessing the views, it will be possible to change the size, fix (which will disable the option to change the size) and still delete the views.
pt_br: O dashboard faz parte da gui-v2, para acessá-lo é necessário utilizar outra url, na versão atual é só adicionar ao final da url “/v2” em relação a interface utilizada nos itens anteriores, por exemplo, no caso do localhost seria http://localhost:8000/v2, veja mais em :doc:`components-and-apis`. As credenciais de login e senha são as mesmas utilizadas no restante da Dojot. Após se logar, uma nova tela abrirá e aparecerá um botão ADICIONAR no canto superior direito, no qual dará as opções de vários tipos de visualização. Neste momento será configurado os parâmetros, na primeira tela “Geral“ será necessário adicionar um nome para a visualização e opcionalmente uma descrição. Na próxima tela irá aparecer a lista de dispositivos, caso não encontre o dispositivo desejado, você poderá pesquisar pelo nome. Após selecionar o dispositivo, serão listados os atributos que estão vinculado a ele, podendo ser escolhida uma cor para apresentação de cada atributo, é possível ainda adicionar uma legenda para a cada atributo. Em “recuperar registros por:“ será possível configurar alguns filtros, você pode selecionar o tipo de filtro de dados de histórico como os “últimos registros”, por “ordem”(minuto, horas dias e meses), e também poderá escolher um intervalo de tempo, além disso você ainda poderá visualizar os registros em “Tempo real”, conforme novos dados forem sendo recebidos eles irão ser exibidos na visualização escolhida. Depois de tudo configurado, será mostrado um resumo com o nome e os atributos escolhidos
