Repository: dojot/docs
Catalog: source/locale/*/LC_MESSAGES/using-api-interface.po
Languages: pt_br

source: Using API interface
pt_br: Utilizando a API da dojot

source: This section provides a complete step-by-step tutorial of how to create, update, send messages to and check historical data of a device. Also, this tutorial assumes that you are using `docker-compose`_, which has all the necessary components to properly run dojot.
pt_br: Esta seção descreve o passo a passo completo de como criar, alterar, enviar mensagens e conferir dados históricos relativo a um dispositivo. Este tutorial assume que está sendo utilizada a instalacao `docker-compose`_ e que todos os componentes necessários estão sendo executados corretamente na dojot.

source: Audience: developers
pt_br: Audiência: desenvolvedores

source: Level: basic
pt_br: Nível: básico

source: Reading time: 15 m
pt_br: Tempo de leitura: 15 minutos

source: Prerequisites
pt_br: Pré-requisitos

source: It uses:
pt_br: Vamos utilizar:

source: `curl`_ to access the dojot platform APIs;
pt_br: `curl`_ para acessar as APIs da plataforma dojot;

source: `jq`_ to process the return JSON from the dojot platform APIs.
pt_br: `jq`_ para processar o retorno JSON das APIs da plataforma dojot.

source: `mosquitto`_ to publish and subscribe in `iotagent-mosca`_ (or iotagent-mqtt) via MQTT.
pt_br: `mosquitto`_ publicar e se subscrever em `iotagent-mosca`_ (or iotagent-mqtt) via MQTT.

source: In Debian-based Linux distributions you can run:
pt_br: Em distribuições Linux baseadas em Debian, você pode executar:

source: Getting access token
pt_br: Obtendo um token de acesso

source: As said in :ref:`User authentication`, all requests must contain a valid access token. You can generate a new token by sending the following request:
pt_br: Como mencionado em :ref:`User authentication`, todas as requisições devem conter um token de acesso que seja válido. É possível gerar um novo token enviando a seguinte requisição:

source: To check:
pt_br: Checar:

source: If you want to generate a token for other user, just change the username and password in the request payload. The token ("eyJ0eXAiOiJKV1QiL...") should be used in every HTTP request sent to dojot in a special header. Such request would look like:
pt_br: Se o intuito for gerar um token para outro usuário, é necessário somente mudar o username e passwd no corpo da requisição. O token ("eyJ0eXAiOiJKV1QiL...") deve ser usado em toda a requisição HTTP enviada para a dojot, colocando-o no cabeçalho da mensagem. A requisição seria algo desse tipo:

source: Remember that the token must be set in the request header as a whole, not parts of it. In the example only the first characters are shown for the sake of simplicity. All further requests will use an evironment variable called ``${JWT}``, which contains the token got from auth component.
pt_br: É importante ressaltar que o token deve estar inteiro no cabeçalho da requisição, não apenas parte dele. No exemplo, somente os primeiros caracteres foram mostrados por questão de simplificação. Todas as demais requisições serão compostas da variável de ambiente chamada ``bash ${JWT}`` que contém o token obtido da dojot (mais especificamente do componente de autorização da dojot).

source: Device creation
pt_br: Criação de dispositivo

source: In order to properly configure a physical device in dojot, you must first create its representation in the platform. The example presented here is just a small part of what is offered by DeviceManager. For more information, check the `DeviceManager how-to`_ for more detailed instructions.
pt_br: A fim de configurar um dispositivo físico na dojot, é necessário criar sua representação na plataforma. O exemplo mostrado aqui é apenas uma parte pequena do que é oferecido pelo componente DeviceManager. Para mais informações sobre esse componente, confira o documento `DeviceManager how-to`_.

source: First of all, let's create a template for the device - all devices are based off of a template, remember.
pt_br: Primeiramente vamos criar um modelo (template) para o dispositivo, pois todos os dispositivos são baseados em modelos, não esqueça.

source: This request should give back this message:
pt_br: Esta requisição deve retornar a seguinte mensagem:

source: Note that the template ID is 1 (line 35), if you have already created another template this id will be different.
pt_br: Note que o template (modelo) ID é 1 (linha 35), caso você já tenha criado algum outro template este id será diferente.

source: To create a template based on it, send the following request to dojot:
pt_br: Para criar um dispositivo baseado nesse modelo (ID 1), envie a seguinte requisição para a dojot:

source: The template ID list on line 6 contains the only template ID configured so far. To check out the configured device, just send a GET request to /device:
pt_br: A lista de IDs de modelos na linha 6 contém um único ID do modelo configurado até o momento. Para conferir os dispositivos configurados, basta enviar uma requisição do tipo GET para /device:

source: Which should give back:
pt_br: Que deve retornar:

source: Sending messages
pt_br: Enviando mensagens

source: So far we got an access token and created a template and a device based on it. In an actual deployment, the physical device would send messages to dojot with all its attributes and their current values. For this tutorial we will send MQTT messages by hand to the platform, emulating such physical device. For that, we will use mosquitto_pub and mosquitto_sub from `mosquitto`_.
pt_br: Até o momento um token de acesso foi obtido, um modelo e um dispositivo (baseado no modelo) foram criados. Em um sistema real, o dispositivo físico envia mensagens para a dojot com todos os seus atributos contendo valores correntes. Nsse tutorial serão enviadas mensagens MQTT montadas "na mão" para a plataforma, emulando um dispositivo físico. Para tal, será utilizado o mosquito_pub e mosquitto_sub do projeto `mosquitto`_.

source: The default message format used by dojot is a simple key-value JSON (you could translate any message format to this scheme using flows, though), such as:
pt_br: O formato padrão de mensagem usado pela dojot é um simples "chave-valor" JSON (é possível traduzir qualquer formato para esse esquema utilizando fluxos), como abaixo:

source: Some Linux distributions, Debian-based Linux distributions in particular, have two packages for `mosquitto`_ - one containing tools to access it (i.e. mosquitto_pub and mosquitto_sub for publishing messages and subscribing to topics) and another one containing the MQTT broker too. In this tutorial, only the tools from package `mosquitto-clients` on Debian-based Linux distributions are going to be used. Please check if MQTT broker is not running before starting dojot (by running commands like ``ps aux | grep mosquitto``) to avoid port conflicts.
pt_br: Algumas distribuições Linux, distribuições Linux baseadas em Debian em particular, tem dois pacotes para `mosquitto`_ - um contendo ferramentas para cliente (ou seja, mosquitto_pub e mosquitto_sub para publicar mensagens e se subscrever tópicos) e outro contendo o broker MQTT também. E neste tutorial, apenas as ferramentas do pacote `mosquitto-clients` em Distribuições Linux baseadas no Debian serão usadas. Verifique se o broker MQTT não está em execução antes de iniciar o dojot (executando comandos como ``ps aux | grep mosquitto``) para evitar conflitos de porta.

source: As of **v0.5.0**, you can choose the between two MQTT brokers: Mosca or VerneMQ. By default, VerneMQ is used, but you can use Mosca too. Check the :doc:`../installation-guide` for more information.
pt_br: A partir da versão **v0.5.0**, você pode escolher entre dois brokers MQTT: Mosca ou VerneMQ. Por padrão, o VerneMQ é utilizado, mas você pode utilizar o Mosca também. Verifique o :doc:`../installation-guide` para mais informações.

source: Using VerneMQ
pt_br: Usando o VerneMQ

source: Let's send a message to dojot:
pt_br: Vamos enviar essa mensagem para a dojot:

source: If there is no output, the message was sent to MQTT broker.
pt_br: Se não houver saída (output), a mensagem foi enviada ao broker MQTT.

source: Note that we sent a message with the parameter ``-q 1``. This means that the message will use QoS 1, i.e., the message is guaranteed to be sent at least one time.
pt_br: Repare que estamos enviando a mensagem com o parâmetro ``-q 1``. Isto significa que a mensagem usará `QoS` 1, i.e., é garantido pelo menos um envio da mensagem.

source: **Also you can send a configuration message from dojot to the device to change some of its attributes. The target attribute must be of type “actuator”.**
pt_br: **Além disso, você pode enviar uma mensagem de configuração da dojot para o dispositivo. O atributo de destino deve ser do tipo “actuator” ou “atuador”.**

source: To simulate receiving the message on a device, we can use ``mosquitto_sub``:
pt_br: Para simular o recebimento da mensagem em um dispositivo, podemos usar o ``mosquitto_sub``:

source: Triggering the sending of the message from the dojot to the device.
pt_br: Disparando o envio da mensagem da dojot para o dispositivo.

source: As noted in the :doc:`../faq/faq`, there are some considerations regarding MQTT topics:
pt_br: Como descrito no :doc:`../faq/faq`, existem algumas considerações a respeito dos tópicos MQTT:

source: You must set the username that originates the message using the ``username`` MQTT parameter. It should follow the following pattern: ``<tenant>:<device-id>``, such as ``admin:efac``. It must match the tenant and device ID set in the topic.
pt_br: Você deve adicionar o ``username`` que originou a mensagem usando o atributo de mesmo nome do MQTT. Ele deve seguir o seguinte padrão: ``<tenant>:<device-id>``, como ``admin:efac``. Ele deve ser o mesmo que o colocado no tópico.

source: The topic to publish messages has the pattern ``<tenant>:<device-id>/attrs`` (e.g.: ``admin:efac/attrs``).
pt_br: O tópico para publicação deve assumir o padrão ``<tenant>:<device-id>/attrs`` (por exemplo: ``admin:efac/attrs``).

source: The topic to subscribe should has the pattern ``<tenant>:<device-id>/config`` (e.g.: ``admin:efac/config``).
pt_br: O tópico de subscrição deve assumir o padrão ``<tenant>:<device-id>/config`` (por exemplo: ``admin:efac/config``).

source: MQTT payload must be a JSON with each key being an attribute of the dojot device, such as:
pt_br: Os dados da mensagem MQTT (payload) deve ser um JSON com cada chave sendo um atributo do dispositivo cadastrado na dojot, como:

source: Using Mosca (legacy)
pt_br: Usando o Mosca (legado)

source: VerneMQ is the new default MQTT broker. Support for Mosca will be eventually dropped, so use VerneMQ if possible!
pt_br: VerneMQ é o novo broker MQTT padrão. O suporte ao Mosca será eventualmente retirado, então use o VerneMQ se possível!

source: To run `mosquitto_pub` and `mosquitto_sub` without using TLS, as in the examples below, you must set the environment variable ALLOW_UNSECURED_MODE with the value `'true'` to the `iotagent-mqtt` service, that is, `ALLOW_UNSECURED_MODE='true'`. You can change this value in the dojot `docker-compose.yml` file and then kill and up the docker-compose again. **By default this value is already 'true'.**
pt_br: Para executar `mosquitto_pub` e `mosquitto_sub` sem usar TLS, como nos exemplos abaixo, você deve definir a variável de ambiente ALLOW_UNSECURED_MODE com o valor` 'true'` para o serviço `iotagent-mqtt`, isto é, `ALLOW_UNSECURED_MODE='true'`. Você pode alterar este valor no arquivo `docker-compose.yml` da dojot e então matar e subir o docker-compose novamente. **Por padrão, esse valor já é 'true'.**

source: You can set the device ID that originates the message using the ``client-id`` MQTT parameter. It should follow the following pattern: ``<tenant>:<device-id>``, such as ``admin:efac``.
pt_br: Pode-se configurar o ID do dispositivo origem da mensagem utilizando o parâmetro MQTT ``client-id``. Deve seguir o seguinte padrão: ``<service>:<deviceid>``, como em ``admin:efac``.

source: If you can't do such thing, then the device should set its ID using the topic used to publish messages. The topic should assume the pattern ``/<tenant>/<device-id>/attrs`` (e.g.: ``/admin/efac/attrs``).
pt_br: Se algo o impossibilita de realizar isto, então o dispositivo deve configurar seu ID no tópico utilizado para publicar as mensagens. O tópico deve assumir o padrão ``/<service-id>/<device-id>/attrs`` (e.g.: ``/admin/efac/attrs``).

source: The topic to subscribe should assume the pattern ``/<tenant>/<device-id>/config`` (e.g.: ``/admin/efac/config``).
pt_br: O tópico deve assumir o padrão ``/<service-id>/<device-id>/config`` (por exemplo: ``/admin/efac/config``).

source: For simplicity's sake, we are not using TLS in these examples. Check :doc:`mosca-tls` for more information on its usage.
pt_br: Por simplicidade, nós não estamos utilizando TLS nos exemplos. Verifique o artigo :doc:`mosca-tls` para maiores esclarecimentos sobre sua utilização.

source: For the rest of the tutorial we will treat as if you are using VerneMQ.
pt_br: Consideraremos a utilização de VerneMQ pelo restante do tutorial.

source: Checking historical data
pt_br: Conferindo dados históricos

source: In order to check all values that were sent from a device for a particular attribute, you could use the history api, see more in :doc:`components-and-apis`. Let's first send a few other values to dojot so we can get a few more interesting results:
pt_br: A fim de se conferir todos os valores que foram enviados pelo dispositivo para um atributo particular, pode-se utilizar a API do History, veja mais em :doc:`components-and-apis`. Vamos, então, enviar agora alguns outros valores à dojot para que possamos conseguir resultados um pouco mais interessantes:

source: To retrieve all values sent for temperature attribute of this device:
pt_br: Para recuperar todos os valores enviados do atributo temperature desse dispositivo:

source: The history endpoint is built from these values:
pt_br: O endpoint do histórico é construído por meio desses valores:

source: ``.../device/0998/...``: the device ID is ``0998`` - this is retrieved from the ``id`` attribute from the device
pt_br: ``.../device/0998/...``: o ID do dispositivo é ``0998`` - isso é obtido do atributo ``id`` do próprio dispositivo

source: ``.../history?lastN=3&attr=temperature``: the requested attribute is temperature and it should get the last 3 values.
pt_br: ``.../history?lastN=3&attr=temperature``: o atributo requerido é temperature e deve ser recuperado os 3 últimos valores.

source: The request should result in the following message:
pt_br: A requisição deve resultar na seguinte mensagem:

source: This message contains all previously sent values.
pt_br: A mensagem acima contém todos os valores previamente enviados pelo dispositivo.
