Repository: dojot/docs
Catalog: source/locale/*/LC_MESSAGES/vms.po
Languages: pt_br

source: Running dojot on VirtualBox
pt_br: Rodando a dojot no VirtualBox

source: This guide provides instructions to run dojot platform on VirtualBox.
pt_br: Este guia provê instruções para rodar a plataforma dojot no VirtualBox.

source: You should only run dojot this way if you don’t have any familiarity with docker and just want to learn how to use dojot. We don’t recommend it for development and much less for experimental or real deployments.
pt_br: Você deve rodar a dojot desta maneira somente se você não tiver nenhuma familiaridade com docker e quiser apenas conhecer a dojot. Não recomendamos rodá-la desta maneira para desenvolvimento e muito menos para qualquer tipo de implantação.

source: The steps described here were checked on Windows 7, but you shouldn’t have problems to run them in different operational systems.
pt_br: Os passos descritos aqui foram validados em Windows 7, mas você não deve ter dificuldade para executá-los num sistema operacional diferente.

source: First of all, if you don’t have VirtualBox you’ll need to install it. Up to date information and installation procedures can be found at the project’s documentation:
pt_br: Primeiramente, se você não tem o VirtualBox, você precisa instalá-lo. Informações e instruções atualizadas estão disponíveis na documentação do projeto:

source: Then, you need to download a virtual machine image with dojot, which is available at:
pt_br: Em seguida, você precisa baixar a imagem da máquina virtual com a dojot, que está disponível em:

source: Click on Next, and set the memory size. We recommend at least 2048 MB.
pt_br: Clique em *Next* e configure o tamanho da memória. Recomendamos pelo menos 2048 MB.

source: Click on Next, and set the hard disk to use an existing virtual hard disk file and choose the downloaded image.
pt_br: Clique em *Next* e configure o disco com a opção *use an existing virtual hard disk file* e selecione a imagem que você baixou.

source: Click on Create.
pt_br: Clique em *Create* para finalizar.

source: Next, click on Settings/Network and check whether the network adapter is enabled and set it to ``Host-only``. This will allow host and guest to communicate to each other. Write down the MAC Address, you will need it later.
pt_br: Em seguida, clique em *Settings/Network* e verifique se a interface está habilitada e configure-a para ``Host-only``. Isto era permitir a comunicação entre o *host* e o *guest*. Anote o *MAC Address*, pois será usado posteriormente.*

source: Click on OK and start the virtual machine.
pt_br: Clique em *OK* e inicie a máquina virtual.

source: Login in the virtual machine (login/password are ``dojot/dojot``) to set the network interface. Firstly, get the interface name:
pt_br: Acesse a máquina virtual (*login/password* são ``dojot/dojot``) para configurar a sua interface de rede. Primeiramente, obtenha o nome da interface:

source: Edit the file ``/etc/network/interfaces``, adding ::
pt_br: Edite o arquivo ``/etc/network/interfaces``, adicionando ::

source: Restart the networking service:
pt_br: Reinicie o serviço de rede:

source: Get the ip address assigned to the interface:
pt_br: Obtenha o endereço ip atribuído à interface:

source: In the host machine, open a browser and type ``<YOUR IP ADDRESS>:8000``.
pt_br: Na máquina *host*, abra um browser e digite ``<YOUR IP ADDRESS>:8000``.
